WebDust21/framework-cmsis-atmelsam/samv71_rt/include/pio/samv71q21rt.h
/*
 * Peripheral I/O description for SAMV71Q21RT
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2023-03-27T04:11:12Z  */
#ifndef _SAMV71Q21RT_GPIO_H_
#define _SAMV71Q21RT_GPIO_H_

/* ======================= Peripheral I/O pin numbers ======================= */
#define PIN_PA0                     (    0)  /* Pin Number for PA0 */
#define PIN_PA1                     (    1)  /* Pin Number for PA1 */
#define PIN_PA2                     (    2)  /* Pin Number for PA2 */
#define PIN_PA3                     (    3)  /* Pin Number for PA3 */
#define PIN_PA4                     (    4)  /* Pin Number for PA4 */
#define PIN_PA5                     (    5)  /* Pin Number for PA5 */
#define PIN_PA6                     (    6)  /* Pin Number for PA6 */
#define PIN_PA7                     (    7)  /* Pin Number for PA7 */
#define PIN_PA8                     (    8)  /* Pin Number for PA8 */
#define PIN_PA9                     (    9)  /* Pin Number for PA9 */
#define PIN_PA10                    (   10)  /* Pin Number for PA10 */
#define PIN_PA11                    (   11)  /* Pin Number for PA11 */
#define PIN_PA12                    (   12)  /* Pin Number for PA12 */
#define PIN_PA13                    (   13)  /* Pin Number for PA13 */
#define PIN_PA14                    (   14)  /* Pin Number for PA14 */
#define PIN_PA15                    (   15)  /* Pin Number for PA15 */
#define PIN_PA16                    (   16)  /* Pin Number for PA16 */
#define PIN_PA17                    (   17)  /* Pin Number for PA17 */
#define PIN_PA18                    (   18)  /* Pin Number for PA18 */
#define PIN_PA19                    (   19)  /* Pin Number for PA19 */
#define PIN_PA20                    (   20)  /* Pin Number for PA20 */
#define PIN_PA21                    (   21)  /* Pin Number for PA21 */
#define PIN_PA22                    (   22)  /* Pin Number for PA22 */
#define PIN_PA23                    (   23)  /* Pin Number for PA23 */
#define PIN_PA24                    (   24)  /* Pin Number for PA24 */
#define PIN_PA25                    (   25)  /* Pin Number for PA25 */
#define PIN_PA26                    (   26)  /* Pin Number for PA26 */
#define PIN_PA27                    (   27)  /* Pin Number for PA27 */
#define PIN_PA28                    (   28)  /* Pin Number for PA28 */
#define PIN_PA29                    (   29)  /* Pin Number for PA29 */
#define PIN_PA30                    (   30)  /* Pin Number for PA30 */
#define PIN_PA31                    (   31)  /* Pin Number for PA31 */
#define PIN_PB0                     (   32)  /* Pin Number for PB0 */
#define PIN_PB1                     (   33)  /* Pin Number for PB1 */
#define PIN_PB2                     (   34)  /* Pin Number for PB2 */
#define PIN_PB3                     (   35)  /* Pin Number for PB3 */
#define PIN_PB4                     (   36)  /* Pin Number for PB4 */
#define PIN_PB5                     (   37)  /* Pin Number for PB5 */
#define PIN_PB6                     (   38)  /* Pin Number for PB6 */
#define PIN_PB7                     (   39)  /* Pin Number for PB7 */
#define PIN_PB8                     (   40)  /* Pin Number for PB8 */
#define PIN_PB9                     (   41)  /* Pin Number for PB9 */
#define PIN_PB12                    (   44)  /* Pin Number for PB12 */
#define PIN_PB13                    (   45)  /* Pin Number for PB13 */
#define PIN_PC0                     (   64)  /* Pin Number for PC0 */
#define PIN_PC1                     (   65)  /* Pin Number for PC1 */
#define PIN_PC2                     (   66)  /* Pin Number for PC2 */
#define PIN_PC3                     (   67)  /* Pin Number for PC3 */
#define PIN_PC4                     (   68)  /* Pin Number for PC4 */
#define PIN_PC5                     (   69)  /* Pin Number for PC5 */
#define PIN_PC6                     (   70)  /* Pin Number for PC6 */
#define PIN_PC7                     (   71)  /* Pin Number for PC7 */
#define PIN_PC8                     (   72)  /* Pin Number for PC8 */
#define PIN_PC9                     (   73)  /* Pin Number for PC9 */
#define PIN_PC10                    (   74)  /* Pin Number for PC10 */
#define PIN_PC11                    (   75)  /* Pin Number for PC11 */
#define PIN_PC12                    (   76)  /* Pin Number for PC12 */
#define PIN_PC13                    (   77)  /* Pin Number for PC13 */
#define PIN_PC14                    (   78)  /* Pin Number for PC14 */
#define PIN_PC15                    (   79)  /* Pin Number for PC15 */
#define PIN_PC16                    (   80)  /* Pin Number for PC16 */
#define PIN_PC17                    (   81)  /* Pin Number for PC17 */
#define PIN_PC18                    (   82)  /* Pin Number for PC18 */
#define PIN_PC19                    (   83)  /* Pin Number for PC19 */
#define PIN_PC20                    (   84)  /* Pin Number for PC20 */
#define PIN_PC21                    (   85)  /* Pin Number for PC21 */
#define PIN_PC22                    (   86)  /* Pin Number for PC22 */
#define PIN_PC23                    (   87)  /* Pin Number for PC23 */
#define PIN_PC24                    (   88)  /* Pin Number for PC24 */
#define PIN_PC25                    (   89)  /* Pin Number for PC25 */
#define PIN_PC26                    (   90)  /* Pin Number for PC26 */
#define PIN_PC27                    (   91)  /* Pin Number for PC27 */
#define PIN_PC28                    (   92)  /* Pin Number for PC28 */
#define PIN_PC29                    (   93)  /* Pin Number for PC29 */
#define PIN_PC30                    (   94)  /* Pin Number for PC30 */
#define PIN_PC31                    (   95)  /* Pin Number for PC31 */
#define PIN_PD0                     (   96)  /* Pin Number for PD0 */
#define PIN_PD1                     (   97)  /* Pin Number for PD1 */
#define PIN_PD2                     (   98)  /* Pin Number for PD2 */
#define PIN_PD3                     (   99)  /* Pin Number for PD3 */
#define PIN_PD4                     (  100)  /* Pin Number for PD4 */
#define PIN_PD5                     (  101)  /* Pin Number for PD5 */
#define PIN_PD6                     (  102)  /* Pin Number for PD6 */
#define PIN_PD7                     (  103)  /* Pin Number for PD7 */
#define PIN_PD8                     (  104)  /* Pin Number for PD8 */
#define PIN_PD9                     (  105)  /* Pin Number for PD9 */
#define PIN_PD10                    (  106)  /* Pin Number for PD10 */
#define PIN_PD11                    (  107)  /* Pin Number for PD11 */
#define PIN_PD12                    (  108)  /* Pin Number for PD12 */
#define PIN_PD13                    (  109)  /* Pin Number for PD13 */
#define PIN_PD14                    (  110)  /* Pin Number for PD14 */
#define PIN_PD15                    (  111)  /* Pin Number for PD15 */
#define PIN_PD16                    (  112)  /* Pin Number for PD16 */
#define PIN_PD17                    (  113)  /* Pin Number for PD17 */
#define PIN_PD18                    (  114)  /* Pin Number for PD18 */
#define PIN_PD19                    (  115)  /* Pin Number for PD19 */
#define PIN_PD20                    (  116)  /* Pin Number for PD20 */
#define PIN_PD21                    (  117)  /* Pin Number for PD21 */
#define PIN_PD22                    (  118)  /* Pin Number for PD22 */
#define PIN_PD23                    (  119)  /* Pin Number for PD23 */
#define PIN_PD24                    (  120)  /* Pin Number for PD24 */
#define PIN_PD25                    (  121)  /* Pin Number for PD25 */
#define PIN_PD26                    (  122)  /* Pin Number for PD26 */
#define PIN_PD27                    (  123)  /* Pin Number for PD27 */
#define PIN_PD28                    (  124)  /* Pin Number for PD28 */
#define PIN_PD29                    (  125)  /* Pin Number for PD29 */
#define PIN_PD30                    (  126)  /* Pin Number for PD30 */
#define PIN_PD31                    (  127)  /* Pin Number for PD31 */
#define PIN_PE0                     (  128)  /* Pin Number for PE0 */
#define PIN_PE1                     (  129)  /* Pin Number for PE1 */
#define PIN_PE2                     (  130)  /* Pin Number for PE2 */
#define PIN_PE3                     (  131)  /* Pin Number for PE3 */
#define PIN_PE4                     (  132)  /* Pin Number for PE4 */
#define PIN_PE5                     (  133)  /* Pin Number for PE5 */

/* ========================== Peripheral I/O masks ========================== */
#define PIO_PA0                     (_UINT32_(1) << 0) /* PIO mask for PA0 */
#define PIO_PA1                     (_UINT32_(1) << 1) /* PIO mask for PA1 */
#define PIO_PA2                     (_UINT32_(1) << 2) /* PIO mask for PA2 */
#define PIO_PA3                     (_UINT32_(1) << 3) /* PIO mask for PA3 */
#define PIO_PA4                     (_UINT32_(1) << 4) /* PIO mask for PA4 */
#define PIO_PA5                     (_UINT32_(1) << 5) /* PIO mask for PA5 */
#define PIO_PA6                     (_UINT32_(1) << 6) /* PIO mask for PA6 */
#define PIO_PA7                     (_UINT32_(1) << 7) /* PIO mask for PA7 */
#define PIO_PA8                     (_UINT32_(1) << 8) /* PIO mask for PA8 */
#define PIO_PA9                     (_UINT32_(1) << 9) /* PIO mask for PA9 */
#define PIO_PA10                    (_UINT32_(1) << 10) /* PIO mask for PA10 */
#define PIO_PA11                    (_UINT32_(1) << 11) /* PIO mask for PA11 */
#define PIO_PA12                    (_UINT32_(1) << 12) /* PIO mask for PA12 */
#define PIO_PA13                    (_UINT32_(1) << 13) /* PIO mask for PA13 */
#define PIO_PA14                    (_UINT32_(1) << 14) /* PIO mask for PA14 */
#define PIO_PA15                    (_UINT32_(1) << 15) /* PIO mask for PA15 */
#define PIO_PA16                    (_UINT32_(1) << 16) /* PIO mask for PA16 */
#define PIO_PA17                    (_UINT32_(1) << 17) /* PIO mask for PA17 */
#define PIO_PA18                    (_UINT32_(1) << 18) /* PIO mask for PA18 */
#define PIO_PA19                    (_UINT32_(1) << 19) /* PIO mask for PA19 */
#define PIO_PA20                    (_UINT32_(1) << 20) /* PIO mask for PA20 */
#define PIO_PA21                    (_UINT32_(1) << 21) /* PIO mask for PA21 */
#define PIO_PA22                    (_UINT32_(1) << 22) /* PIO mask for PA22 */
#define PIO_PA23                    (_UINT32_(1) << 23) /* PIO mask for PA23 */
#define PIO_PA24                    (_UINT32_(1) << 24) /* PIO mask for PA24 */
#define PIO_PA25                    (_UINT32_(1) << 25) /* PIO mask for PA25 */
#define PIO_PA26                    (_UINT32_(1) << 26) /* PIO mask for PA26 */
#define PIO_PA27                    (_UINT32_(1) << 27) /* PIO mask for PA27 */
#define PIO_PA28                    (_UINT32_(1) << 28) /* PIO mask for PA28 */
#define PIO_PA29                    (_UINT32_(1) << 29) /* PIO mask for PA29 */
#define PIO_PA30                    (_UINT32_(1) << 30) /* PIO mask for PA30 */
#define PIO_PA31                    (_UINT32_(1) << 31) /* PIO mask for PA31 */
#define PIO_PB0                     (_UINT32_(1) << 0) /* PIO mask for PB0 */
#define PIO_PB1                     (_UINT32_(1) << 1) /* PIO mask for PB1 */
#define PIO_PB2                     (_UINT32_(1) << 2) /* PIO mask for PB2 */
#define PIO_PB3                     (_UINT32_(1) << 3) /* PIO mask for PB3 */
#define PIO_PB4                     (_UINT32_(1) << 4) /* PIO mask for PB4 */
#define PIO_PB5                     (_UINT32_(1) << 5) /* PIO mask for PB5 */
#define PIO_PB6                     (_UINT32_(1) << 6) /* PIO mask for PB6 */
#define PIO_PB7                     (_UINT32_(1) << 7) /* PIO mask for PB7 */
#define PIO_PB8                     (_UINT32_(1) << 8) /* PIO mask for PB8 */
#define PIO_PB9                     (_UINT32_(1) << 9) /* PIO mask for PB9 */
#define PIO_PB12                    (_UINT32_(1) << 12) /* PIO mask for PB12 */
#define PIO_PB13                    (_UINT32_(1) << 13) /* PIO mask for PB13 */
#define PIO_PC0                     (_UINT32_(1) << 0) /* PIO mask for PC0 */
#define PIO_PC1                     (_UINT32_(1) << 1) /* PIO mask for PC1 */
#define PIO_PC2                     (_UINT32_(1) << 2) /* PIO mask for PC2 */
#define PIO_PC3                     (_UINT32_(1) << 3) /* PIO mask for PC3 */
#define PIO_PC4                     (_UINT32_(1) << 4) /* PIO mask for PC4 */
#define PIO_PC5                     (_UINT32_(1) << 5) /* PIO mask for PC5 */
#define PIO_PC6                     (_UINT32_(1) << 6) /* PIO mask for PC6 */
#define PIO_PC7                     (_UINT32_(1) << 7) /* PIO mask for PC7 */
#define PIO_PC8                     (_UINT32_(1) << 8) /* PIO mask for PC8 */
#define PIO_PC9                     (_UINT32_(1) << 9) /* PIO mask for PC9 */
#define PIO_PC10                    (_UINT32_(1) << 10) /* PIO mask for PC10 */
#define PIO_PC11                    (_UINT32_(1) << 11) /* PIO mask for PC11 */
#define PIO_PC12                    (_UINT32_(1) << 12) /* PIO mask for PC12 */
#define PIO_PC13                    (_UINT32_(1) << 13) /* PIO mask for PC13 */
#define PIO_PC14                    (_UINT32_(1) << 14) /* PIO mask for PC14 */
#define PIO_PC15                    (_UINT32_(1) << 15) /* PIO mask for PC15 */
#define PIO_PC16                    (_UINT32_(1) << 16) /* PIO mask for PC16 */
#define PIO_PC17                    (_UINT32_(1) << 17) /* PIO mask for PC17 */
#define PIO_PC18                    (_UINT32_(1) << 18) /* PIO mask for PC18 */
#define PIO_PC19                    (_UINT32_(1) << 19) /* PIO mask for PC19 */
#define PIO_PC20                    (_UINT32_(1) << 20) /* PIO mask for PC20 */
#define PIO_PC21                    (_UINT32_(1) << 21) /* PIO mask for PC21 */
#define PIO_PC22                    (_UINT32_(1) << 22) /* PIO mask for PC22 */
#define PIO_PC23                    (_UINT32_(1) << 23) /* PIO mask for PC23 */
#define PIO_PC24                    (_UINT32_(1) << 24) /* PIO mask for PC24 */
#define PIO_PC25                    (_UINT32_(1) << 25) /* PIO mask for PC25 */
#define PIO_PC26                    (_UINT32_(1) << 26) /* PIO mask for PC26 */
#define PIO_PC27                    (_UINT32_(1) << 27) /* PIO mask for PC27 */
#define PIO_PC28                    (_UINT32_(1) << 28) /* PIO mask for PC28 */
#define PIO_PC29                    (_UINT32_(1) << 29) /* PIO mask for PC29 */
#define PIO_PC30                    (_UINT32_(1) << 30) /* PIO mask for PC30 */
#define PIO_PC31                    (_UINT32_(1) << 31) /* PIO mask for PC31 */
#define PIO_PD0                     (_UINT32_(1) << 0) /* PIO mask for PD0 */
#define PIO_PD1                     (_UINT32_(1) << 1) /* PIO mask for PD1 */
#define PIO_PD2                     (_UINT32_(1) << 2) /* PIO mask for PD2 */
#define PIO_PD3                     (_UINT32_(1) << 3) /* PIO mask for PD3 */
#define PIO_PD4                     (_UINT32_(1) << 4) /* PIO mask for PD4 */
#define PIO_PD5                     (_UINT32_(1) << 5) /* PIO mask for PD5 */
#define PIO_PD6                     (_UINT32_(1) << 6) /* PIO mask for PD6 */
#define PIO_PD7                     (_UINT32_(1) << 7) /* PIO mask for PD7 */
#define PIO_PD8                     (_UINT32_(1) << 8) /* PIO mask for PD8 */
#define PIO_PD9                     (_UINT32_(1) << 9) /* PIO mask for PD9 */
#define PIO_PD10                    (_UINT32_(1) << 10) /* PIO mask for PD10 */
#define PIO_PD11                    (_UINT32_(1) << 11) /* PIO mask for PD11 */
#define PIO_PD12                    (_UINT32_(1) << 12) /* PIO mask for PD12 */
#define PIO_PD13                    (_UINT32_(1) << 13) /* PIO mask for PD13 */
#define PIO_PD14                    (_UINT32_(1) << 14) /* PIO mask for PD14 */
#define PIO_PD15                    (_UINT32_(1) << 15) /* PIO mask for PD15 */
#define PIO_PD16                    (_UINT32_(1) << 16) /* PIO mask for PD16 */
#define PIO_PD17                    (_UINT32_(1) << 17) /* PIO mask for PD17 */
#define PIO_PD18                    (_UINT32_(1) << 18) /* PIO mask for PD18 */
#define PIO_PD19                    (_UINT32_(1) << 19) /* PIO mask for PD19 */
#define PIO_PD20                    (_UINT32_(1) << 20) /* PIO mask for PD20 */
#define PIO_PD21                    (_UINT32_(1) << 21) /* PIO mask for PD21 */
#define PIO_PD22                    (_UINT32_(1) << 22) /* PIO mask for PD22 */
#define PIO_PD23                    (_UINT32_(1) << 23) /* PIO mask for PD23 */
#define PIO_PD24                    (_UINT32_(1) << 24) /* PIO mask for PD24 */
#define PIO_PD25                    (_UINT32_(1) << 25) /* PIO mask for PD25 */
#define PIO_PD26                    (_UINT32_(1) << 26) /* PIO mask for PD26 */
#define PIO_PD27                    (_UINT32_(1) << 27) /* PIO mask for PD27 */
#define PIO_PD28                    (_UINT32_(1) << 28) /* PIO mask for PD28 */
#define PIO_PD29                    (_UINT32_(1) << 29) /* PIO mask for PD29 */
#define PIO_PD30                    (_UINT32_(1) << 30) /* PIO mask for PD30 */
#define PIO_PD31                    (_UINT32_(1) << 31) /* PIO mask for PD31 */
#define PIO_PE0                     (_UINT32_(1) << 0) /* PIO mask for PE0 */
#define PIO_PE1                     (_UINT32_(1) << 1) /* PIO mask for PE1 */
#define PIO_PE2                     (_UINT32_(1) << 2) /* PIO mask for PE2 */
#define PIO_PE3                     (_UINT32_(1) << 3) /* PIO mask for PE3 */
#define PIO_PE4                     (_UINT32_(1) << 4) /* PIO mask for PE4 */
#define PIO_PE5                     (_UINT32_(1) << 5) /* PIO mask for PE5 */

