WebDust21/framework-cmsis-atmelsam/samv71_rt/include/pio/samv71q21rt.h
/* ================== PIO definition for AFEC0 peripheral =================== */
#define PIN_PD30X1_AFEC0_AD0                       _UINT32_(126) /* AFEC0 signal: AFEC0_AD0 on PD30 mux X1 */
#define PIO_PD30X1_AFEC0_AD0                       (_UINT32_(1) << 30) /* AFEC0 signal: AFEC0_AD0 */
#define PIN_PA21X1_AFEC0_AD1                       _UINT32_(21) /* AFEC0 signal: AFEC0_AD1 on PA21 mux X1 */
#define PIO_PA21X1_AFEC0_AD1                       (_UINT32_(1) << 21) /* AFEC0 signal: AFEC0_AD1 */
#define PIN_PB3X1_AFEC0_AD2                        _UINT32_(35) /* AFEC0 signal: AFEC0_AD2 on PB3 mux X1 */
#define PIO_PB3X1_AFEC0_AD2                        (_UINT32_(1) << 3) /* AFEC0 signal: AFEC0_AD2 */
#define PIN_PE5X1_AFEC0_AD3                        _UINT32_(133) /* AFEC0 signal: AFEC0_AD3 on PE5 mux X1 */
#define PIO_PE5X1_AFEC0_AD3                        (_UINT32_(1) << 5) /* AFEC0 signal: AFEC0_AD3 */
#define PIN_PE4X1_AFEC0_AD4                        _UINT32_(132) /* AFEC0 signal: AFEC0_AD4 on PE4 mux X1 */
#define PIO_PE4X1_AFEC0_AD4                        (_UINT32_(1) << 4) /* AFEC0 signal: AFEC0_AD4 */
#define PIN_PB2X1_AFEC0_AD5                        _UINT32_(34) /* AFEC0 signal: AFEC0_AD5 on PB2 mux X1 */
#define PIO_PB2X1_AFEC0_AD5                        (_UINT32_(1) << 2) /* AFEC0 signal: AFEC0_AD5 */
#define PIN_PA17X1_AFEC0_AD6                       _UINT32_(17) /* AFEC0 signal: AFEC0_AD6 on PA17 mux X1 */
#define PIO_PA17X1_AFEC0_AD6                       (_UINT32_(1) << 17) /* AFEC0 signal: AFEC0_AD6 */
#define PIN_PA18X1_AFEC0_AD7                       _UINT32_(18) /* AFEC0 signal: AFEC0_AD7 on PA18 mux X1 */
#define PIO_PA18X1_AFEC0_AD7                       (_UINT32_(1) << 18) /* AFEC0 signal: AFEC0_AD7 */
#define PIN_PA19X1_AFEC0_AD8                       _UINT32_(19) /* AFEC0 signal: AFEC0_AD8 on PA19 mux X1 */
#define PIO_PA19X1_AFEC0_AD8                       (_UINT32_(1) << 19) /* AFEC0 signal: AFEC0_AD8 */
#define PIN_PA20X1_AFEC0_AD9                       _UINT32_(20) /* AFEC0 signal: AFEC0_AD9 on PA20 mux X1 */
#define PIO_PA20X1_AFEC0_AD9                       (_UINT32_(1) << 20) /* AFEC0 signal: AFEC0_AD9 */
#define PIN_PB0X1_AFEC0_AD10                       _UINT32_(32) /* AFEC0 signal: AFEC0_AD10 on PB0 mux X1 */
#define PIO_PB0X1_AFEC0_AD10                       (_UINT32_(1) << 0) /* AFEC0 signal: AFEC0_AD10 */
#define PIN_PA8B_AFEC0_ADTRG                       _UINT32_(8)  /* AFEC0 signal: AFEC0_ADTRG on PA8 mux B */
#define MUX_PA8B_AFEC0_ADTRG                       _UINT32_(1)  /* AFEC0 signal line function value: AFEC0_ADTRG */
#define PIO_PA8B_AFEC0_ADTRG                       (_UINT32_(1) << 8) /* AFEC0 signal: AFEC0_ADTRG */
/* ================== PIO definition for AFEC1 peripheral =================== */
#define PIN_PB1X1_AFEC1_AD0                        _UINT32_(33) /* AFEC1 signal: AFEC1_AD0 on PB1 mux X1 */
#define PIO_PB1X1_AFEC1_AD0                        (_UINT32_(1) << 1) /* AFEC1 signal: AFEC1_AD0 */
#define PIN_PC13X1_AFEC1_AD1                       _UINT32_(77) /* AFEC1 signal: AFEC1_AD1 on PC13 mux X1 */
#define PIO_PC13X1_AFEC1_AD1                       (_UINT32_(1) << 13) /* AFEC1 signal: AFEC1_AD1 */
#define PIN_PC15X1_AFEC1_AD2                       _UINT32_(79) /* AFEC1 signal: AFEC1_AD2 on PC15 mux X1 */
#define PIO_PC15X1_AFEC1_AD2                       (_UINT32_(1) << 15) /* AFEC1 signal: AFEC1_AD2 */
#define PIN_PC12X1_AFEC1_AD3                       _UINT32_(76) /* AFEC1 signal: AFEC1_AD3 on PC12 mux X1 */
#define PIO_PC12X1_AFEC1_AD3                       (_UINT32_(1) << 12) /* AFEC1 signal: AFEC1_AD3 */
#define PIN_PC29X1_AFEC1_AD4                       _UINT32_(93) /* AFEC1 signal: AFEC1_AD4 on PC29 mux X1 */
#define PIO_PC29X1_AFEC1_AD4                       (_UINT32_(1) << 29) /* AFEC1 signal: AFEC1_AD4 */
#define PIN_PC30X1_AFEC1_AD5                       _UINT32_(94) /* AFEC1 signal: AFEC1_AD5 on PC30 mux X1 */
#define PIO_PC30X1_AFEC1_AD5                       (_UINT32_(1) << 30) /* AFEC1 signal: AFEC1_AD5 */
#define PIN_PC31X1_AFEC1_AD6                       _UINT32_(95) /* AFEC1 signal: AFEC1_AD6 on PC31 mux X1 */
#define PIO_PC31X1_AFEC1_AD6                       (_UINT32_(1) << 31) /* AFEC1 signal: AFEC1_AD6 */
#define PIN_PC26X1_AFEC1_AD7                       _UINT32_(90) /* AFEC1 signal: AFEC1_AD7 on PC26 mux X1 */
#define PIO_PC26X1_AFEC1_AD7                       (_UINT32_(1) << 26) /* AFEC1 signal: AFEC1_AD7 */
#define PIN_PC27X1_AFEC1_AD8                       _UINT32_(91) /* AFEC1 signal: AFEC1_AD8 on PC27 mux X1 */
#define PIO_PC27X1_AFEC1_AD8                       (_UINT32_(1) << 27) /* AFEC1 signal: AFEC1_AD8 */
#define PIN_PC0X1_AFEC1_AD9                        _UINT32_(64) /* AFEC1 signal: AFEC1_AD9 on PC0 mux X1 */
#define PIO_PC0X1_AFEC1_AD9                        (_UINT32_(1) << 0) /* AFEC1 signal: AFEC1_AD9 */
#define PIN_PE3X1_AFEC1_AD10                       _UINT32_(131) /* AFEC1 signal: AFEC1_AD10 on PE3 mux X1 */
#define PIO_PE3X1_AFEC1_AD10                       (_UINT32_(1) << 3) /* AFEC1 signal: AFEC1_AD10 */
#define PIN_PE0X1_AFEC1_AD11                       _UINT32_(128) /* AFEC1 signal: AFEC1_AD11 on PE0 mux X1 */
#define PIO_PE0X1_AFEC1_AD11                       (_UINT32_(1) << 0) /* AFEC1 signal: AFEC1_AD11 */
#define PIN_PD9C_AFEC1_ADTRG                       _UINT32_(105) /* AFEC1 signal: AFEC1_ADTRG on PD9 mux C */
#define MUX_PD9C_AFEC1_ADTRG                       _UINT32_(2)  /* AFEC1 signal line function value: AFEC1_ADTRG */
#define PIO_PD9C_AFEC1_ADTRG                       (_UINT32_(1) << 9) /* AFEC1 signal: AFEC1_ADTRG */
/* =================== PIO definition for DACC peripheral =================== */
#define PIN_PB13X1_DACC_DAC0                       _UINT32_(45) /* DACC signal: DACC_DAC0 on PB13 mux X1 */
#define PIO_PB13X1_DACC_DAC0                       (_UINT32_(1) << 13) /* DACC signal: DACC_DAC0 */
#define PIN_PD0X1_DACC_DAC1                        _UINT32_(96) /* DACC signal: DACC_DAC1 on PD0 mux X1 */
#define PIO_PD0X1_DACC_DAC1                        (_UINT32_(1) << 0) /* DACC signal: DACC_DAC1 */
#define PIN_PA2C_DACC_DATRG                        _UINT32_(2)  /* DACC signal: DACC_DATRG on PA2 mux C */
#define MUX_PA2C_DACC_DATRG                        _UINT32_(2)  /* DACC signal line function value: DACC_DATRG */
#define PIO_PA2C_DACC_DATRG                        (_UINT32_(1) << 2) /* DACC signal: DACC_DATRG */
/* =================== PIO definition for EBI peripheral ==================== */
#define PIN_PC18A_EBI_A0                           _UINT32_(82) /* EBI signal: EBI_A0 on PC18 mux A */
#define MUX_PC18A_EBI_A0                           _UINT32_(0)  /* EBI signal line function value: EBI_A0 */
#define PIO_PC18A_EBI_A0                           (_UINT32_(1) << 18) /* EBI signal: EBI_A0 */
#define PIN_PC19A_EBI_A1                           _UINT32_(83) /* EBI signal: EBI_A1 on PC19 mux A */
#define MUX_PC19A_EBI_A1                           _UINT32_(0)  /* EBI signal line function value: EBI_A1 */
#define PIO_PC19A_EBI_A1                           (_UINT32_(1) << 19) /* EBI signal: EBI_A1 */
#define PIN_PC20A_EBI_A2                           _UINT32_(84) /* EBI signal: EBI_A2 on PC20 mux A */
#define MUX_PC20A_EBI_A2                           _UINT32_(0)  /* EBI signal line function value: EBI_A2 */
#define PIO_PC20A_EBI_A2                           (_UINT32_(1) << 20) /* EBI signal: EBI_A2 */
#define PIN_PC21A_EBI_A3                           _UINT32_(85) /* EBI signal: EBI_A3 on PC21 mux A */
#define MUX_PC21A_EBI_A3                           _UINT32_(0)  /* EBI signal line function value: EBI_A3 */
#define PIO_PC21A_EBI_A3                           (_UINT32_(1) << 21) /* EBI signal: EBI_A3 */
#define PIN_PC22A_EBI_A4                           _UINT32_(86) /* EBI signal: EBI_A4 on PC22 mux A */
#define MUX_PC22A_EBI_A4                           _UINT32_(0)  /* EBI signal line function value: EBI_A4 */
#define PIO_PC22A_EBI_A4                           (_UINT32_(1) << 22) /* EBI signal: EBI_A4 */
#define PIN_PC23A_EBI_A5                           _UINT32_(87) /* EBI signal: EBI_A5 on PC23 mux A */
#define MUX_PC23A_EBI_A5                           _UINT32_(0)  /* EBI signal line function value: EBI_A5 */
#define PIO_PC23A_EBI_A5                           (_UINT32_(1) << 23) /* EBI signal: EBI_A5 */
#define PIN_PC24A_EBI_A6                           _UINT32_(88) /* EBI signal: EBI_A6 on PC24 mux A */
#define MUX_PC24A_EBI_A6                           _UINT32_(0)  /* EBI signal line function value: EBI_A6 */
#define PIO_PC24A_EBI_A6                           (_UINT32_(1) << 24) /* EBI signal: EBI_A6 */
#define PIN_PC25A_EBI_A7                           _UINT32_(89) /* EBI signal: EBI_A7 on PC25 mux A */
#define MUX_PC25A_EBI_A7                           _UINT32_(0)  /* EBI signal line function value: EBI_A7 */
#define PIO_PC25A_EBI_A7                           (_UINT32_(1) << 25) /* EBI signal: EBI_A7 */
#define PIN_PC26A_EBI_A8                           _UINT32_(90) /* EBI signal: EBI_A8 on PC26 mux A */
#define MUX_PC26A_EBI_A8                           _UINT32_(0)  /* EBI signal line function value: EBI_A8 */
#define PIO_PC26A_EBI_A8                           (_UINT32_(1) << 26) /* EBI signal: EBI_A8 */
#define PIN_PC27A_EBI_A9                           _UINT32_(91) /* EBI signal: EBI_A9 on PC27 mux A */
#define MUX_PC27A_EBI_A9                           _UINT32_(0)  /* EBI signal line function value: EBI_A9 */
#define PIO_PC27A_EBI_A9                           (_UINT32_(1) << 27) /* EBI signal: EBI_A9 */
#define PIN_PC28A_EBI_A10                          _UINT32_(92) /* EBI signal: EBI_A10 on PC28 mux A */
#define MUX_PC28A_EBI_A10                          _UINT32_(0)  /* EBI signal line function value: EBI_A10 */
#define PIO_PC28A_EBI_A10                          (_UINT32_(1) << 28) /* EBI signal: EBI_A10 */
#define PIN_PC29A_EBI_A11                          _UINT32_(93) /* EBI signal: EBI_A11 on PC29 mux A */
#define MUX_PC29A_EBI_A11                          _UINT32_(0)  /* EBI signal line function value: EBI_A11 */
#define PIO_PC29A_EBI_A11                          (_UINT32_(1) << 29) /* EBI signal: EBI_A11 */
#define PIN_PC30A_EBI_A12                          _UINT32_(94) /* EBI signal: EBI_A12 on PC30 mux A */
#define MUX_PC30A_EBI_A12                          _UINT32_(0)  /* EBI signal line function value: EBI_A12 */
#define PIO_PC30A_EBI_A12                          (_UINT32_(1) << 30) /* EBI signal: EBI_A12 */
#define PIN_PC31A_EBI_A13                          _UINT32_(95) /* EBI signal: EBI_A13 on PC31 mux A */
#define MUX_PC31A_EBI_A13                          _UINT32_(0)  /* EBI signal line function value: EBI_A13 */
#define PIO_PC31A_EBI_A13                          (_UINT32_(1) << 31) /* EBI signal: EBI_A13 */
#define PIN_PA18C_EBI_A14                          _UINT32_(18) /* EBI signal: EBI_A14 on PA18 mux C */
#define MUX_PA18C_EBI_A14                          _UINT32_(2)  /* EBI signal line function value: EBI_A14 */
#define PIO_PA18C_EBI_A14                          (_UINT32_(1) << 18) /* EBI signal: EBI_A14 */
#define PIN_PA19C_EBI_A15                          _UINT32_(19) /* EBI signal: EBI_A15 on PA19 mux C */
#define MUX_PA19C_EBI_A15                          _UINT32_(2)  /* EBI signal line function value: EBI_A15 */
#define PIO_PA19C_EBI_A15                          (_UINT32_(1) << 19) /* EBI signal: EBI_A15 */
#define PIN_PA20C_EBI_A16                          _UINT32_(20) /* EBI signal: EBI_A16 on PA20 mux C */
#define MUX_PA20C_EBI_A16                          _UINT32_(2)  /* EBI signal line function value: EBI_A16 */
#define PIO_PA20C_EBI_A16                          (_UINT32_(1) << 20) /* EBI signal: EBI_A16 */
#define PIN_PA0C_EBI_A17                           _UINT32_(0)  /* EBI signal: EBI_A17 on PA0 mux C */
#define MUX_PA0C_EBI_A17                           _UINT32_(2)  /* EBI signal line function value: EBI_A17 */
#define PIO_PA0C_EBI_A17                           (_UINT32_(1) << 0) /* EBI signal: EBI_A17 */
#define PIN_PA1C_EBI_A18                           _UINT32_(1)  /* EBI signal: EBI_A18 on PA1 mux C */
#define MUX_PA1C_EBI_A18                           _UINT32_(2)  /* EBI signal line function value: EBI_A18 */
#define PIO_PA1C_EBI_A18                           (_UINT32_(1) << 1) /* EBI signal: EBI_A18 */
#define PIN_PA23C_EBI_A19                          _UINT32_(23) /* EBI signal: EBI_A19 on PA23 mux C */
#define MUX_PA23C_EBI_A19                          _UINT32_(2)  /* EBI signal line function value: EBI_A19 */
#define PIO_PA23C_EBI_A19                          (_UINT32_(1) << 23) /* EBI signal: EBI_A19 */
#define PIN_PA24C_EBI_A20                          _UINT32_(24) /* EBI signal: EBI_A20 on PA24 mux C */
#define MUX_PA24C_EBI_A20                          _UINT32_(2)  /* EBI signal line function value: EBI_A20 */
#define PIO_PA24C_EBI_A20                          (_UINT32_(1) << 24) /* EBI signal: EBI_A20 */
#define PIN_PC16A_EBI_A21                          _UINT32_(80) /* EBI signal: EBI_A21 on PC16 mux A */
#define MUX_PC16A_EBI_A21                          _UINT32_(0)  /* EBI signal line function value: EBI_A21 */
#define PIO_PC16A_EBI_A21                          (_UINT32_(1) << 16) /* EBI signal: EBI_A21 */
#define PIN_PC17A_EBI_A22                          _UINT32_(81) /* EBI signal: EBI_A22 on PC17 mux A */
#define MUX_PC17A_EBI_A22                          _UINT32_(0)  /* EBI signal line function value: EBI_A22 */
#define PIO_PC17A_EBI_A22                          (_UINT32_(1) << 17) /* EBI signal: EBI_A22 */
#define PIN_PA25C_EBI_A23                          _UINT32_(25) /* EBI signal: EBI_A23 on PA25 mux C */
#define MUX_PA25C_EBI_A23                          _UINT32_(2)  /* EBI signal line function value: EBI_A23 */
#define PIO_PA25C_EBI_A23                          (_UINT32_(1) << 25) /* EBI signal: EBI_A23 */
#define PIN_PA20C_EBI_BA0                          _UINT32_(20) /* EBI signal: EBI_BA0 on PA20 mux C */
#define MUX_PA20C_EBI_BA0                          _UINT32_(2)  /* EBI signal line function value: EBI_BA0 */
#define PIO_PA20C_EBI_BA0                          (_UINT32_(1) << 20) /* EBI signal: EBI_BA0 */
#define PIN_PA0C_EBI_BA1                           _UINT32_(0)  /* EBI signal: EBI_BA1 on PA0 mux C */
#define MUX_PA0C_EBI_BA1                           _UINT32_(2)  /* EBI signal line function value: EBI_BA1 */
#define PIO_PA0C_EBI_BA1                           (_UINT32_(1) << 0) /* EBI signal: EBI_BA1 */
#define PIN_PD17C_EBI_CAS                          _UINT32_(113) /* EBI signal: EBI_CAS on PD17 mux C */
#define MUX_PD17C_EBI_CAS                          _UINT32_(2)  /* EBI signal line function value: EBI_CAS */
#define PIO_PD17C_EBI_CAS                          (_UINT32_(1) << 17) /* EBI signal: EBI_CAS */
#define PIN_PC0A_EBI_D0                            _UINT32_(64) /* EBI signal: EBI_D0 on PC0 mux A */
#define MUX_PC0A_EBI_D0                            _UINT32_(0)  /* EBI signal line function value: EBI_D0 */
#define PIO_PC0A_EBI_D0                            (_UINT32_(1) << 0) /* EBI signal: EBI_D0 */
#define PIN_PC1A_EBI_D1                            _UINT32_(65) /* EBI signal: EBI_D1 on PC1 mux A */
#define MUX_PC1A_EBI_D1                            _UINT32_(0)  /* EBI signal line function value: EBI_D1 */
#define PIO_PC1A_EBI_D1                            (_UINT32_(1) << 1) /* EBI signal: EBI_D1 */
#define PIN_PC2A_EBI_D2                            _UINT32_(66) /* EBI signal: EBI_D2 on PC2 mux A */
#define MUX_PC2A_EBI_D2                            _UINT32_(0)  /* EBI signal line function value: EBI_D2 */
#define PIO_PC2A_EBI_D2                            (_UINT32_(1) << 2) /* EBI signal: EBI_D2 */
#define PIN_PC3A_EBI_D3                            _UINT32_(67) /* EBI signal: EBI_D3 on PC3 mux A */
#define MUX_PC3A_EBI_D3                            _UINT32_(0)  /* EBI signal line function value: EBI_D3 */
#define PIO_PC3A_EBI_D3                            (_UINT32_(1) << 3) /* EBI signal: EBI_D3 */
#define PIN_PC4A_EBI_D4                            _UINT32_(68) /* EBI signal: EBI_D4 on PC4 mux A */
#define MUX_PC4A_EBI_D4                            _UINT32_(0)  /* EBI signal line function value: EBI_D4 */
#define PIO_PC4A_EBI_D4                            (_UINT32_(1) << 4) /* EBI signal: EBI_D4 */
#define PIN_PC5A_EBI_D5                            _UINT32_(69) /* EBI signal: EBI_D5 on PC5 mux A */
#define MUX_PC5A_EBI_D5                            _UINT32_(0)  /* EBI signal line function value: EBI_D5 */
#define PIO_PC5A_EBI_D5                            (_UINT32_(1) << 5) /* EBI signal: EBI_D5 */
#define PIN_PC6A_EBI_D6                            _UINT32_(70) /* EBI signal: EBI_D6 on PC6 mux A */
#define MUX_PC6A_EBI_D6                            _UINT32_(0)  /* EBI signal line function value: EBI_D6 */
#define PIO_PC6A_EBI_D6                            (_UINT32_(1) << 6) /* EBI signal: EBI_D6 */
#define PIN_PC7A_EBI_D7                            _UINT32_(71) /* EBI signal: EBI_D7 on PC7 mux A */
#define MUX_PC7A_EBI_D7                            _UINT32_(0)  /* EBI signal line function value: EBI_D7 */
#define PIO_PC7A_EBI_D7                            (_UINT32_(1) << 7) /* EBI signal: EBI_D7 */
#define PIN_PE0A_EBI_D8                            _UINT32_(128) /* EBI signal: EBI_D8 on PE0 mux A */
#define MUX_PE0A_EBI_D8                            _UINT32_(0)  /* EBI signal line function value: EBI_D8 */
#define PIO_PE0A_EBI_D8                            (_UINT32_(1) << 0) /* EBI signal: EBI_D8 */
#define PIN_PE1A_EBI_D9                            _UINT32_(129) /* EBI signal: EBI_D9 on PE1 mux A */
#define MUX_PE1A_EBI_D9                            _UINT32_(0)  /* EBI signal line function value: EBI_D9 */
#define PIO_PE1A_EBI_D9                            (_UINT32_(1) << 1) /* EBI signal: EBI_D9 */
#define PIN_PE2A_EBI_D10                           _UINT32_(130) /* EBI signal: EBI_D10 on PE2 mux A */
#define MUX_PE2A_EBI_D10                           _UINT32_(0)  /* EBI signal line function value: EBI_D10 */
#define PIO_PE2A_EBI_D10                           (_UINT32_(1) << 2) /* EBI signal: EBI_D10 */
#define PIN_PE3A_EBI_D11                           _UINT32_(131) /* EBI signal: EBI_D11 on PE3 mux A */
#define MUX_PE3A_EBI_D11                           _UINT32_(0)  /* EBI signal line function value: EBI_D11 */
#define PIO_PE3A_EBI_D11                           (_UINT32_(1) << 3) /* EBI signal: EBI_D11 */
#define PIN_PE4A_EBI_D12                           _UINT32_(132) /* EBI signal: EBI_D12 on PE4 mux A */
#define MUX_PE4A_EBI_D12                           _UINT32_(0)  /* EBI signal line function value: EBI_D12 */
#define PIO_PE4A_EBI_D12                           (_UINT32_(1) << 4) /* EBI signal: EBI_D12 */
#define PIN_PE5A_EBI_D13                           _UINT32_(133) /* EBI signal: EBI_D13 on PE5 mux A */
#define MUX_PE5A_EBI_D13                           _UINT32_(0)  /* EBI signal line function value: EBI_D13 */
#define PIO_PE5A_EBI_D13                           (_UINT32_(1) << 5) /* EBI signal: EBI_D13 */
#define PIN_PA15A_EBI_D14                          _UINT32_(15) /* EBI signal: EBI_D14 on PA15 mux A */
#define MUX_PA15A_EBI_D14                          _UINT32_(0)  /* EBI signal line function value: EBI_D14 */
#define PIO_PA15A_EBI_D14                          (_UINT32_(1) << 15) /* EBI signal: EBI_D14 */
#define PIN_PA16A_EBI_D15                          _UINT32_(16) /* EBI signal: EBI_D15 on PA16 mux A */
#define MUX_PA16A_EBI_D15                          _UINT32_(0)  /* EBI signal line function value: EBI_D15 */
#define PIO_PA16A_EBI_D15                          (_UINT32_(1) << 16) /* EBI signal: EBI_D15 */
#define PIN_PC18A_EBI_DQM0                         _UINT32_(82) /* EBI signal: EBI_DQM0 on PC18 mux A */
#define MUX_PC18A_EBI_DQM0                         _UINT32_(0)  /* EBI signal line function value: EBI_DQM0 */
#define PIO_PC18A_EBI_DQM0                         (_UINT32_(1) << 18) /* EBI signal: EBI_DQM0 */
#define PIN_PD15C_EBI_DQM1                         _UINT32_(111) /* EBI signal: EBI_DQM1 on PD15 mux C */
#define MUX_PD15C_EBI_DQM1                         _UINT32_(2)  /* EBI signal line function value: EBI_DQM1 */
#define PIO_PD15C_EBI_DQM1                         (_UINT32_(1) << 15) /* EBI signal: EBI_DQM1 */
#define PIN_PC16A_EBI_NANDALE                      _UINT32_(80) /* EBI signal: EBI_NANDALE on PC16 mux A */
#define MUX_PC16A_EBI_NANDALE                      _UINT32_(0)  /* EBI signal line function value: EBI_NANDALE */
#define PIO_PC16A_EBI_NANDALE                      (_UINT32_(1) << 16) /* EBI signal: EBI_NANDALE */
#define PIN_PC17A_EBI_NANDCLE                      _UINT32_(81) /* EBI signal: EBI_NANDCLE on PC17 mux A */
#define MUX_PC17A_EBI_NANDCLE                      _UINT32_(0)  /* EBI signal line function value: EBI_NANDCLE */
#define PIO_PC17A_EBI_NANDCLE                      (_UINT32_(1) << 17) /* EBI signal: EBI_NANDCLE */
#define PIN_PC9A_EBI_NANDOE                        _UINT32_(73) /* EBI signal: EBI_NANDOE on PC9 mux A */
#define MUX_PC9A_EBI_NANDOE                        _UINT32_(0)  /* EBI signal line function value: EBI_NANDOE */
#define PIO_PC9A_EBI_NANDOE                        (_UINT32_(1) << 9) /* EBI signal: EBI_NANDOE */
#define PIN_PC10A_EBI_NANDWE                       _UINT32_(74) /* EBI signal: EBI_NANDWE on PC10 mux A */
#define MUX_PC10A_EBI_NANDWE                       _UINT32_(0)  /* EBI signal line function value: EBI_NANDWE */
#define PIO_PC10A_EBI_NANDWE                       (_UINT32_(1) << 10) /* EBI signal: EBI_NANDWE */
#define PIN_PC18A_EBI_NBS0                         _UINT32_(82) /* EBI signal: EBI_NBS0 on PC18 mux A */
#define MUX_PC18A_EBI_NBS0                         _UINT32_(0)  /* EBI signal line function value: EBI_NBS0 */
#define PIO_PC18A_EBI_NBS0                         (_UINT32_(1) << 18) /* EBI signal: EBI_NBS0 */
#define PIN_PD15C_EBI_NBS1                         _UINT32_(111) /* EBI signal: EBI_NBS1 on PD15 mux C */
#define MUX_PD15C_EBI_NBS1                         _UINT32_(2)  /* EBI signal line function value: EBI_NBS1 */
#define PIO_PD15C_EBI_NBS1                         (_UINT32_(1) << 15) /* EBI signal: EBI_NBS1 */
#define PIN_PC14A_EBI_NCS0                         _UINT32_(78) /* EBI signal: EBI_NCS0 on PC14 mux A */
#define MUX_PC14A_EBI_NCS0                         _UINT32_(0)  /* EBI signal line function value: EBI_NCS0 */
#define PIO_PC14A_EBI_NCS0                         (_UINT32_(1) << 14) /* EBI signal: EBI_NCS0 */
#define PIN_PC15A_EBI_NCS1                         _UINT32_(79) /* EBI signal: EBI_NCS1 on PC15 mux A */
#define MUX_PC15A_EBI_NCS1                         _UINT32_(0)  /* EBI signal line function value: EBI_NCS1 */
#define PIO_PC15A_EBI_NCS1                         (_UINT32_(1) << 15) /* EBI signal: EBI_NCS1 */
#define PIN_PD18A_EBI_NCS1                         _UINT32_(114) /* EBI signal: EBI_NCS1 on PD18 mux A */
#define MUX_PD18A_EBI_NCS1                         _UINT32_(0)  /* EBI signal line function value: EBI_NCS1 */
#define PIO_PD18A_EBI_NCS1                         (_UINT32_(1) << 18) /* EBI signal: EBI_NCS1 */
#define PIN_PA22C_EBI_NCS2                         _UINT32_(22) /* EBI signal: EBI_NCS2 on PA22 mux C */
#define MUX_PA22C_EBI_NCS2                         _UINT32_(2)  /* EBI signal line function value: EBI_NCS2 */
#define PIO_PA22C_EBI_NCS2                         (_UINT32_(1) << 22) /* EBI signal: EBI_NCS2 */
#define PIN_PC12A_EBI_NCS3                         _UINT32_(76) /* EBI signal: EBI_NCS3 on PC12 mux A */
#define MUX_PC12A_EBI_NCS3                         _UINT32_(0)  /* EBI signal line function value: EBI_NCS3 */
#define PIO_PC12A_EBI_NCS3                         (_UINT32_(1) << 12) /* EBI signal: EBI_NCS3 */
