WebDust21/framework-cmsis-atmelsam/samv71_rt/include/pio/samv71q21rt.h
#define PIN_PD28D_ISI_D9                           _UINT32_(124) /* ISI signal: ISI_D9 on PD28 mux D */
#define MUX_PD28D_ISI_D9                           _UINT32_(3)  /* ISI signal line function value: ISI_D9 */
#define PIO_PD28D_ISI_D9                           (_UINT32_(1) << 28) /* ISI signal: ISI_D9 */
#define PIN_PD30D_ISI_D10                          _UINT32_(126) /* ISI signal: ISI_D10 on PD30 mux D */
#define MUX_PD30D_ISI_D10                          _UINT32_(3)  /* ISI signal line function value: ISI_D10 */
#define PIO_PD30D_ISI_D10                          (_UINT32_(1) << 30) /* ISI signal: ISI_D10 */
#define PIN_PD31D_ISI_D11                          _UINT32_(127) /* ISI signal: ISI_D11 on PD31 mux D */
#define MUX_PD31D_ISI_D11                          _UINT32_(3)  /* ISI signal line function value: ISI_D11 */
#define PIO_PD31D_ISI_D11                          (_UINT32_(1) << 31) /* ISI signal: ISI_D11 */
#define PIN_PD24D_ISI_HSYNC                        _UINT32_(120) /* ISI signal: ISI_HSYNC on PD24 mux D */
#define MUX_PD24D_ISI_HSYNC                        _UINT32_(3)  /* ISI signal line function value: ISI_HSYNC */
#define PIO_PD24D_ISI_HSYNC                        (_UINT32_(1) << 24) /* ISI signal: ISI_HSYNC */
#define PIN_PA24D_ISI_PCK                          _UINT32_(24) /* ISI signal: ISI_PCK on PA24 mux D */
#define MUX_PA24D_ISI_PCK                          _UINT32_(3)  /* ISI signal line function value: ISI_PCK */
#define PIO_PA24D_ISI_PCK                          (_UINT32_(1) << 24) /* ISI signal: ISI_PCK */
#define PIN_PD25D_ISI_VSYNC                        _UINT32_(121) /* ISI signal: ISI_VSYNC on PD25 mux D */
#define MUX_PD25D_ISI_VSYNC                        _UINT32_(3)  /* ISI signal line function value: ISI_VSYNC */
#define PIO_PD25D_ISI_VSYNC                        (_UINT32_(1) << 25) /* ISI signal: ISI_VSYNC */
/* ================== PIO definition for MCAN0 peripheral =================== */
#define PIN_PB3A_MCAN0_CANRX0                      _UINT32_(35) /* MCAN0 signal: MCAN0_CANRX0 on PB3 mux A */
#define MUX_PB3A_MCAN0_CANRX0                      _UINT32_(0)  /* MCAN0 signal line function value: MCAN0_CANRX0 */
#define PIO_PB3A_MCAN0_CANRX0                      (_UINT32_(1) << 3) /* MCAN0 signal: MCAN0_CANRX0 */
#define PIN_PB2A_MCAN0_CANTX0                      _UINT32_(34) /* MCAN0 signal: MCAN0_CANTX0 on PB2 mux A */
#define MUX_PB2A_MCAN0_CANTX0                      _UINT32_(0)  /* MCAN0 signal line function value: MCAN0_CANTX0 */
#define PIO_PB2A_MCAN0_CANTX0                      (_UINT32_(1) << 2) /* MCAN0 signal: MCAN0_CANTX0 */
/* ================== PIO definition for MCAN1 peripheral =================== */
#define PIN_PC12C_MCAN1_CANRX1                     _UINT32_(76) /* MCAN1 signal: MCAN1_CANRX1 on PC12 mux C */
#define MUX_PC12C_MCAN1_CANRX1                     _UINT32_(2)  /* MCAN1 signal line function value: MCAN1_CANRX1 */
#define PIO_PC12C_MCAN1_CANRX1                     (_UINT32_(1) << 12) /* MCAN1 signal: MCAN1_CANRX1 */
#define PIN_PC14C_MCAN1_CANTX1                     _UINT32_(78) /* MCAN1 signal: MCAN1_CANTX1 on PC14 mux C */
#define MUX_PC14C_MCAN1_CANTX1                     _UINT32_(2)  /* MCAN1 signal line function value: MCAN1_CANTX1 */
#define PIO_PC14C_MCAN1_CANTX1                     (_UINT32_(1) << 14) /* MCAN1 signal: MCAN1_CANTX1 */
#define PIN_PD12B_MCAN1_CANTX1                     _UINT32_(108) /* MCAN1 signal: MCAN1_CANTX1 on PD12 mux B */
#define MUX_PD12B_MCAN1_CANTX1                     _UINT32_(1)  /* MCAN1 signal line function value: MCAN1_CANTX1 */
#define PIO_PD12B_MCAN1_CANTX1                     (_UINT32_(1) << 12) /* MCAN1 signal: MCAN1_CANTX1 */
/* =================== PIO definition for MLB peripheral ==================== */
#define PIN_PB4C_MLB_MLBCLK                        _UINT32_(36) /* MLB signal: MLB_MLBCLK on PB4 mux C */
#define MUX_PB4C_MLB_MLBCLK                        _UINT32_(2)  /* MLB signal line function value: MLB_MLBCLK */
#define PIO_PB4C_MLB_MLBCLK                        (_UINT32_(1) << 4) /* MLB signal: MLB_MLBCLK */
#define PIN_PB5C_MLB_MLBDAT                        _UINT32_(37) /* MLB signal: MLB_MLBDAT on PB5 mux C */
#define MUX_PB5C_MLB_MLBDAT                        _UINT32_(2)  /* MLB signal line function value: MLB_MLBDAT */
#define PIO_PB5C_MLB_MLBDAT                        (_UINT32_(1) << 5) /* MLB signal: MLB_MLBDAT */
#define PIN_PD10D_MLB_MLBSIG                       _UINT32_(106) /* MLB signal: MLB_MLBSIG on PD10 mux D */
#define MUX_PD10D_MLB_MLBSIG                       _UINT32_(3)  /* MLB signal line function value: MLB_MLBSIG */
#define PIO_PD10D_MLB_MLBSIG                       (_UINT32_(1) << 10) /* MLB signal: MLB_MLBSIG */
/* =================== PIO definition for PMC peripheral ==================== */
#define PIN_PA6B_PMC_PCK0                          _UINT32_(6)  /* PMC signal: PMC_PCK0 on PA6 mux B */
#define MUX_PA6B_PMC_PCK0                          _UINT32_(1)  /* PMC signal line function value: PMC_PCK0 */
#define PIO_PA6B_PMC_PCK0                          (_UINT32_(1) << 6) /* PMC signal: PMC_PCK0 */
#define PIN_PB12D_PMC_PCK0                         _UINT32_(44) /* PMC signal: PMC_PCK0 on PB12 mux D */
#define MUX_PB12D_PMC_PCK0                         _UINT32_(3)  /* PMC signal line function value: PMC_PCK0 */
#define PIO_PB12D_PMC_PCK0                         (_UINT32_(1) << 12) /* PMC signal: PMC_PCK0 */
#define PIN_PB13B_PMC_PCK0                         _UINT32_(45) /* PMC signal: PMC_PCK0 on PB13 mux B */
#define MUX_PB13B_PMC_PCK0                         _UINT32_(1)  /* PMC signal line function value: PMC_PCK0 */
#define PIO_PB13B_PMC_PCK0                         (_UINT32_(1) << 13) /* PMC signal: PMC_PCK0 */
#define PIN_PA17B_PMC_PCK1                         _UINT32_(17) /* PMC signal: PMC_PCK1 on PA17 mux B */
#define MUX_PA17B_PMC_PCK1                         _UINT32_(1)  /* PMC signal line function value: PMC_PCK1 */
#define PIO_PA17B_PMC_PCK1                         (_UINT32_(1) << 17) /* PMC signal: PMC_PCK1 */
#define PIN_PA21B_PMC_PCK1                         _UINT32_(21) /* PMC signal: PMC_PCK1 on PA21 mux B */
#define MUX_PA21B_PMC_PCK1                         _UINT32_(1)  /* PMC signal line function value: PMC_PCK1 */
#define PIO_PA21B_PMC_PCK1                         (_UINT32_(1) << 21) /* PMC signal: PMC_PCK1 */
#define PIN_PA3C_PMC_PCK2                          _UINT32_(3)  /* PMC signal: PMC_PCK2 on PA3 mux C */
#define MUX_PA3C_PMC_PCK2                          _UINT32_(2)  /* PMC signal line function value: PMC_PCK2 */
#define PIO_PA3C_PMC_PCK2                          (_UINT32_(1) << 3) /* PMC signal: PMC_PCK2 */
#define PIN_PA18B_PMC_PCK2                         _UINT32_(18) /* PMC signal: PMC_PCK2 on PA18 mux B */
#define MUX_PA18B_PMC_PCK2                         _UINT32_(1)  /* PMC signal line function value: PMC_PCK2 */
#define PIO_PA18B_PMC_PCK2                         (_UINT32_(1) << 18) /* PMC signal: PMC_PCK2 */
#define PIN_PA31B_PMC_PCK2                         _UINT32_(31) /* PMC signal: PMC_PCK2 on PA31 mux B */
#define MUX_PA31B_PMC_PCK2                         _UINT32_(1)  /* PMC signal line function value: PMC_PCK2 */
#define PIO_PA31B_PMC_PCK2                         (_UINT32_(1) << 31) /* PMC signal: PMC_PCK2 */
#define PIN_PB3B_PMC_PCK2                          _UINT32_(35) /* PMC signal: PMC_PCK2 on PB3 mux B */
#define MUX_PB3B_PMC_PCK2                          _UINT32_(1)  /* PMC signal line function value: PMC_PCK2 */
#define PIO_PB3B_PMC_PCK2                          (_UINT32_(1) << 3) /* PMC signal: PMC_PCK2 */
#define PIN_PD31C_PMC_PCK2                         _UINT32_(127) /* PMC signal: PMC_PCK2 on PD31 mux C */
#define MUX_PD31C_PMC_PCK2                         _UINT32_(2)  /* PMC signal line function value: PMC_PCK2 */
#define PIO_PD31C_PMC_PCK2                         (_UINT32_(1) << 31) /* PMC signal: PMC_PCK2 */
#define PIN_PB9X1_PMC_XIN                          _UINT32_(41) /* PMC signal: PMC_XIN on PB9 mux X1 */
#define PIO_PB9X1_PMC_XIN                          (_UINT32_(1) << 9) /* PMC signal: PMC_XIN */
#define PIN_PA7X1_PMC_XIN32                        _UINT32_(7)  /* PMC signal: PMC_XIN32 on PA7 mux X1 */
#define PIO_PA7X1_PMC_XIN32                        (_UINT32_(1) << 7) /* PMC signal: PMC_XIN32 */
#define PIN_PB8X1_PMC_XOUT                         _UINT32_(40) /* PMC signal: PMC_XOUT on PB8 mux X1 */
#define PIO_PB8X1_PMC_XOUT                         (_UINT32_(1) << 8) /* PMC signal: PMC_XOUT */
#define PIN_PA8X1_PMC_XOUT32                       _UINT32_(8)  /* PMC signal: PMC_XOUT32 on PA8 mux X1 */
#define PIO_PA8X1_PMC_XOUT32                       (_UINT32_(1) << 8) /* PMC signal: PMC_XOUT32 */
/* =================== PIO definition for PWM0 peripheral =================== */
#define PIN_PA10B_PWM0_PWMEXTRG0                   _UINT32_(10) /* PWM0 signal: PWM0_PWMEXTRG0 on PA10 mux B */
#define MUX_PA10B_PWM0_PWMEXTRG0                   _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMEXTRG0 */
#define PIO_PA10B_PWM0_PWMEXTRG0                   (_UINT32_(1) << 10) /* PWM0 signal: PWM0_PWMEXTRG0 */
#define PIN_PA22B_PWM0_PWMEXTRG1                   _UINT32_(22) /* PWM0 signal: PWM0_PWMEXTRG1 on PA22 mux B */
#define MUX_PA22B_PWM0_PWMEXTRG1                   _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMEXTRG1 */
#define PIO_PA22B_PWM0_PWMEXTRG1                   (_UINT32_(1) << 22) /* PWM0 signal: PWM0_PWMEXTRG1 */
#define PIN_PA9C_PWM0_PWMFI0                       _UINT32_(9)  /* PWM0 signal: PWM0_PWMFI0 on PA9 mux C */
#define MUX_PA9C_PWM0_PWMFI0                       _UINT32_(2)  /* PWM0 signal line function value: PWM0_PWMFI0 */
#define PIO_PA9C_PWM0_PWMFI0                       (_UINT32_(1) << 9) /* PWM0 signal: PWM0_PWMFI0 */
#define PIN_PD8B_PWM0_PWMFI1                       _UINT32_(104) /* PWM0 signal: PWM0_PWMFI1 on PD8 mux B */
#define MUX_PD8B_PWM0_PWMFI1                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMFI1 */
#define PIO_PD8B_PWM0_PWMFI1                       (_UINT32_(1) << 8) /* PWM0 signal: PWM0_PWMFI1 */
#define PIN_PD9B_PWM0_PWMFI2                       _UINT32_(105) /* PWM0 signal: PWM0_PWMFI2 on PD9 mux B */
#define MUX_PD9B_PWM0_PWMFI2                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMFI2 */
#define PIO_PD9B_PWM0_PWMFI2                       (_UINT32_(1) << 9) /* PWM0 signal: PWM0_PWMFI2 */
#define PIN_PA0A_PWM0_PWMH0                        _UINT32_(0)  /* PWM0 signal: PWM0_PWMH0 on PA0 mux A */
#define MUX_PA0A_PWM0_PWMH0                        _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWMH0 */
#define PIO_PA0A_PWM0_PWMH0                        (_UINT32_(1) << 0) /* PWM0 signal: PWM0_PWMH0 */
#define PIN_PA11B_PWM0_PWMH0                       _UINT32_(11) /* PWM0 signal: PWM0_PWMH0 on PA11 mux B */
#define MUX_PA11B_PWM0_PWMH0                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMH0 */
#define PIO_PA11B_PWM0_PWMH0                       (_UINT32_(1) << 11) /* PWM0 signal: PWM0_PWMH0 */
#define PIN_PA23B_PWM0_PWMH0                       _UINT32_(23) /* PWM0 signal: PWM0_PWMH0 on PA23 mux B */
#define MUX_PA23B_PWM0_PWMH0                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMH0 */
#define PIO_PA23B_PWM0_PWMH0                       (_UINT32_(1) << 23) /* PWM0 signal: PWM0_PWMH0 */
#define PIN_PB0A_PWM0_PWMH0                        _UINT32_(32) /* PWM0 signal: PWM0_PWMH0 on PB0 mux A */
#define MUX_PB0A_PWM0_PWMH0                        _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWMH0 */
#define PIO_PB0A_PWM0_PWMH0                        (_UINT32_(1) << 0) /* PWM0 signal: PWM0_PWMH0 */
#define PIN_PD11B_PWM0_PWMH0                       _UINT32_(107) /* PWM0 signal: PWM0_PWMH0 on PD11 mux B */
#define MUX_PD11B_PWM0_PWMH0                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMH0 */
#define PIO_PD11B_PWM0_PWMH0                       (_UINT32_(1) << 11) /* PWM0 signal: PWM0_PWMH0 */
#define PIN_PD20A_PWM0_PWMH0                       _UINT32_(116) /* PWM0 signal: PWM0_PWMH0 on PD20 mux A */
#define MUX_PD20A_PWM0_PWMH0                       _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWMH0 */
#define PIO_PD20A_PWM0_PWMH0                       (_UINT32_(1) << 20) /* PWM0 signal: PWM0_PWMH0 */
#define PIN_PA2A_PWM0_PWMH1                        _UINT32_(2)  /* PWM0 signal: PWM0_PWMH1 on PA2 mux A */
#define MUX_PA2A_PWM0_PWMH1                        _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWMH1 */
#define PIO_PA2A_PWM0_PWMH1                        (_UINT32_(1) << 2) /* PWM0 signal: PWM0_PWMH1 */
#define PIN_PA12B_PWM0_PWMH1                       _UINT32_(12) /* PWM0 signal: PWM0_PWMH1 on PA12 mux B */
#define MUX_PA12B_PWM0_PWMH1                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMH1 */
#define PIO_PA12B_PWM0_PWMH1                       (_UINT32_(1) << 12) /* PWM0 signal: PWM0_PWMH1 */
#define PIN_PA24B_PWM0_PWMH1                       _UINT32_(24) /* PWM0 signal: PWM0_PWMH1 on PA24 mux B */
#define MUX_PA24B_PWM0_PWMH1                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMH1 */
#define PIO_PA24B_PWM0_PWMH1                       (_UINT32_(1) << 24) /* PWM0 signal: PWM0_PWMH1 */
#define PIN_PB1A_PWM0_PWMH1                        _UINT32_(33) /* PWM0 signal: PWM0_PWMH1 on PB1 mux A */
#define MUX_PB1A_PWM0_PWMH1                        _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWMH1 */
#define PIO_PB1A_PWM0_PWMH1                        (_UINT32_(1) << 1) /* PWM0 signal: PWM0_PWMH1 */
#define PIN_PD21A_PWM0_PWMH1                       _UINT32_(117) /* PWM0 signal: PWM0_PWMH1 on PD21 mux A */
#define MUX_PD21A_PWM0_PWMH1                       _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWMH1 */
#define PIO_PD21A_PWM0_PWMH1                       (_UINT32_(1) << 21) /* PWM0 signal: PWM0_PWMH1 */
#define PIN_PA13B_PWM0_PWMH2                       _UINT32_(13) /* PWM0 signal: PWM0_PWMH2 on PA13 mux B */
#define MUX_PA13B_PWM0_PWMH2                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMH2 */
#define PIO_PA13B_PWM0_PWMH2                       (_UINT32_(1) << 13) /* PWM0 signal: PWM0_PWMH2 */
#define PIN_PA25B_PWM0_PWMH2                       _UINT32_(25) /* PWM0 signal: PWM0_PWMH2 on PA25 mux B */
#define MUX_PA25B_PWM0_PWMH2                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMH2 */
#define PIO_PA25B_PWM0_PWMH2                       (_UINT32_(1) << 25) /* PWM0 signal: PWM0_PWMH2 */
#define PIN_PB4B_PWM0_PWMH2                        _UINT32_(36) /* PWM0 signal: PWM0_PWMH2 on PB4 mux B */
#define MUX_PB4B_PWM0_PWMH2                        _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMH2 */
#define PIO_PB4B_PWM0_PWMH2                        (_UINT32_(1) << 4) /* PWM0 signal: PWM0_PWMH2 */
#define PIN_PC19B_PWM0_PWMH2                       _UINT32_(83) /* PWM0 signal: PWM0_PWMH2 on PC19 mux B */
#define MUX_PC19B_PWM0_PWMH2                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMH2 */
#define PIO_PC19B_PWM0_PWMH2                       (_UINT32_(1) << 19) /* PWM0 signal: PWM0_PWMH2 */
#define PIN_PD22A_PWM0_PWMH2                       _UINT32_(118) /* PWM0 signal: PWM0_PWMH2 on PD22 mux A */
#define MUX_PD22A_PWM0_PWMH2                       _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWMH2 */
#define PIO_PD22A_PWM0_PWMH2                       (_UINT32_(1) << 22) /* PWM0 signal: PWM0_PWMH2 */
#define PIN_PA7B_PWM0_PWMH3                        _UINT32_(7)  /* PWM0 signal: PWM0_PWMH3 on PA7 mux B */
#define MUX_PA7B_PWM0_PWMH3                        _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMH3 */
#define PIO_PA7B_PWM0_PWMH3                        (_UINT32_(1) << 7) /* PWM0 signal: PWM0_PWMH3 */
#define PIN_PA14B_PWM0_PWMH3                       _UINT32_(14) /* PWM0 signal: PWM0_PWMH3 on PA14 mux B */
#define MUX_PA14B_PWM0_PWMH3                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMH3 */
#define PIO_PA14B_PWM0_PWMH3                       (_UINT32_(1) << 14) /* PWM0 signal: PWM0_PWMH3 */
#define PIN_PA17C_PWM0_PWMH3                       _UINT32_(17) /* PWM0 signal: PWM0_PWMH3 on PA17 mux C */
#define MUX_PA17C_PWM0_PWMH3                       _UINT32_(2)  /* PWM0 signal line function value: PWM0_PWMH3 */
#define PIO_PA17C_PWM0_PWMH3                       (_UINT32_(1) << 17) /* PWM0 signal: PWM0_PWMH3 */
#define PIN_PC13B_PWM0_PWMH3                       _UINT32_(77) /* PWM0 signal: PWM0_PWMH3 on PC13 mux B */
#define MUX_PC13B_PWM0_PWMH3                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMH3 */
#define PIO_PC13B_PWM0_PWMH3                       (_UINT32_(1) << 13) /* PWM0 signal: PWM0_PWMH3 */
#define PIN_PC21B_PWM0_PWMH3                       _UINT32_(85) /* PWM0 signal: PWM0_PWMH3 on PC21 mux B */
#define MUX_PC21B_PWM0_PWMH3                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWMH3 */
#define PIO_PC21B_PWM0_PWMH3                       (_UINT32_(1) << 21) /* PWM0 signal: PWM0_PWMH3 */
#define PIN_PD23A_PWM0_PWMH3                       _UINT32_(119) /* PWM0 signal: PWM0_PWMH3 on PD23 mux A */
#define MUX_PD23A_PWM0_PWMH3                       _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWMH3 */
#define PIO_PD23A_PWM0_PWMH3                       (_UINT32_(1) << 23) /* PWM0 signal: PWM0_PWMH3 */
#define PIN_PA1A_PWM0_PWML0                        _UINT32_(1)  /* PWM0 signal: PWM0_PWML0 on PA1 mux A */
#define MUX_PA1A_PWM0_PWML0                        _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PA1A_PWM0_PWML0                        (_UINT32_(1) << 1) /* PWM0 signal: PWM0_PWML0 */
#define PIN_PA19B_PWM0_PWML0                       _UINT32_(19) /* PWM0 signal: PWM0_PWML0 on PA19 mux B */
#define MUX_PA19B_PWM0_PWML0                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PA19B_PWM0_PWML0                       (_UINT32_(1) << 19) /* PWM0 signal: PWM0_PWML0 */
#define PIN_PB5B_PWM0_PWML0                        _UINT32_(37) /* PWM0 signal: PWM0_PWML0 on PB5 mux B */
#define MUX_PB5B_PWM0_PWML0                        _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PB5B_PWM0_PWML0                        (_UINT32_(1) << 5) /* PWM0 signal: PWM0_PWML0 */
#define PIN_PC0B_PWM0_PWML0                        _UINT32_(64) /* PWM0 signal: PWM0_PWML0 on PC0 mux B */
#define MUX_PC0B_PWM0_PWML0                        _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PC0B_PWM0_PWML0                        (_UINT32_(1) << 0) /* PWM0 signal: PWM0_PWML0 */
#define PIN_PD10B_PWM0_PWML0                       _UINT32_(106) /* PWM0 signal: PWM0_PWML0 on PD10 mux B */
#define MUX_PD10B_PWM0_PWML0                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PD10B_PWM0_PWML0                       (_UINT32_(1) << 10) /* PWM0 signal: PWM0_PWML0 */
#define PIN_PD24A_PWM0_PWML0                       _UINT32_(120) /* PWM0 signal: PWM0_PWML0 on PD24 mux A */
#define MUX_PD24A_PWM0_PWML0                       _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PD24A_PWM0_PWML0                       (_UINT32_(1) << 24) /* PWM0 signal: PWM0_PWML0 */
#define PIN_PA20B_PWM0_PWML1                       _UINT32_(20) /* PWM0 signal: PWM0_PWML1 on PA20 mux B */
#define MUX_PA20B_PWM0_PWML1                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWML1 */
#define PIO_PA20B_PWM0_PWML1                       (_UINT32_(1) << 20) /* PWM0 signal: PWM0_PWML1 */
#define PIN_PB12A_PWM0_PWML1                       _UINT32_(44) /* PWM0 signal: PWM0_PWML1 on PB12 mux A */
#define MUX_PB12A_PWM0_PWML1                       _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWML1 */
#define PIO_PB12A_PWM0_PWML1                       (_UINT32_(1) << 12) /* PWM0 signal: PWM0_PWML1 */
#define PIN_PC1B_PWM0_PWML1                        _UINT32_(65) /* PWM0 signal: PWM0_PWML1 on PC1 mux B */
#define MUX_PC1B_PWM0_PWML1                        _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWML1 */
#define PIO_PC1B_PWM0_PWML1                        (_UINT32_(1) << 1) /* PWM0 signal: PWM0_PWML1 */
#define PIN_PC18B_PWM0_PWML1                       _UINT32_(82) /* PWM0 signal: PWM0_PWML1 on PC18 mux B */
#define MUX_PC18B_PWM0_PWML1                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWML1 */
#define PIO_PC18B_PWM0_PWML1                       (_UINT32_(1) << 18) /* PWM0 signal: PWM0_PWML1 */
#define PIN_PD25A_PWM0_PWML1                       _UINT32_(121) /* PWM0 signal: PWM0_PWML1 on PD25 mux A */
#define MUX_PD25A_PWM0_PWML1                       _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWML1 */
#define PIO_PD25A_PWM0_PWML1                       (_UINT32_(1) << 25) /* PWM0 signal: PWM0_PWML1 */
#define PIN_PA16C_PWM0_PWML2                       _UINT32_(16) /* PWM0 signal: PWM0_PWML2 on PA16 mux C */
#define MUX_PA16C_PWM0_PWML2                       _UINT32_(2)  /* PWM0 signal line function value: PWM0_PWML2 */
#define PIO_PA16C_PWM0_PWML2                       (_UINT32_(1) << 16) /* PWM0 signal: PWM0_PWML2 */
#define PIN_PA30A_PWM0_PWML2                       _UINT32_(30) /* PWM0 signal: PWM0_PWML2 on PA30 mux A */
#define MUX_PA30A_PWM0_PWML2                       _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWML2 */
#define PIO_PA30A_PWM0_PWML2                       (_UINT32_(1) << 30) /* PWM0 signal: PWM0_PWML2 */
#define PIN_PB13A_PWM0_PWML2                       _UINT32_(45) /* PWM0 signal: PWM0_PWML2 on PB13 mux A */
#define MUX_PB13A_PWM0_PWML2                       _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWML2 */
#define PIO_PB13A_PWM0_PWML2                       (_UINT32_(1) << 13) /* PWM0 signal: PWM0_PWML2 */
#define PIN_PC2B_PWM0_PWML2                        _UINT32_(66) /* PWM0 signal: PWM0_PWML2 on PC2 mux B */
#define MUX_PC2B_PWM0_PWML2                        _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWML2 */
#define PIO_PC2B_PWM0_PWML2                        (_UINT32_(1) << 2) /* PWM0 signal: PWM0_PWML2 */
#define PIN_PC20B_PWM0_PWML2                       _UINT32_(84) /* PWM0 signal: PWM0_PWML2 on PC20 mux B */
#define MUX_PC20B_PWM0_PWML2                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWML2 */
#define PIO_PC20B_PWM0_PWML2                       (_UINT32_(1) << 20) /* PWM0 signal: PWM0_PWML2 */
#define PIN_PD26A_PWM0_PWML2                       _UINT32_(122) /* PWM0 signal: PWM0_PWML2 on PD26 mux A */
#define MUX_PD26A_PWM0_PWML2                       _UINT32_(0)  /* PWM0 signal line function value: PWM0_PWML2 */
#define PIO_PD26A_PWM0_PWML2                       (_UINT32_(1) << 26) /* PWM0 signal: PWM0_PWML2 */
#define PIN_PA15C_PWM0_PWML3                       _UINT32_(15) /* PWM0 signal: PWM0_PWML3 on PA15 mux C */
#define MUX_PA15C_PWM0_PWML3                       _UINT32_(2)  /* PWM0 signal line function value: PWM0_PWML3 */
#define PIO_PA15C_PWM0_PWML3                       (_UINT32_(1) << 15) /* PWM0 signal: PWM0_PWML3 */
#define PIN_PC3B_PWM0_PWML3                        _UINT32_(67) /* PWM0 signal: PWM0_PWML3 on PC3 mux B */
#define MUX_PC3B_PWM0_PWML3                        _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWML3 */
#define PIO_PC3B_PWM0_PWML3                        (_UINT32_(1) << 3) /* PWM0 signal: PWM0_PWML3 */
#define PIN_PC15B_PWM0_PWML3                       _UINT32_(79) /* PWM0 signal: PWM0_PWML3 on PC15 mux B */
#define MUX_PC15B_PWM0_PWML3                       _UINT32_(1)  /* PWM0 signal line function value: PWM0_PWML3 */
