WebDust21/framework-cmsis-atmelsam/samv71_rt/include/pio/samv71q21rt.h
#define PIN_PA16B_TC0_TIOB1                        _UINT32_(16) /* TC0 signal: TC0_TIOB1 on PA16 mux B */
#define MUX_PA16B_TC0_TIOB1                        _UINT32_(1)  /* TC0 signal line function value: TC0_TIOB1 */
#define PIO_PA16B_TC0_TIOB1                        (_UINT32_(1) << 16) /* TC0 signal: TC0_TIOB1 */
#define PIN_PA27B_TC0_TIOB2                        _UINT32_(27) /* TC0 signal: TC0_TIOB2 on PA27 mux B */
#define MUX_PA27B_TC0_TIOB2                        _UINT32_(1)  /* TC0 signal line function value: TC0_TIOB2 */
#define PIO_PA27B_TC0_TIOB2                        (_UINT32_(1) << 27) /* TC0 signal: TC0_TIOB2 */
/* =================== PIO definition for TC1 peripheral ==================== */
#define PIN_PC25B_TC1_TCLK3                        _UINT32_(89) /* TC1 signal: TC1_TCLK3 on PC25 mux B */
#define MUX_PC25B_TC1_TCLK3                        _UINT32_(1)  /* TC1 signal line function value: TC1_TCLK3 */
#define PIO_PC25B_TC1_TCLK3                        (_UINT32_(1) << 25) /* TC1 signal: TC1_TCLK3 */
#define PIN_PC28B_TC1_TCLK4                        _UINT32_(92) /* TC1 signal: TC1_TCLK4 on PC28 mux B */
#define MUX_PC28B_TC1_TCLK4                        _UINT32_(1)  /* TC1 signal line function value: TC1_TCLK4 */
#define PIO_PC28B_TC1_TCLK4                        (_UINT32_(1) << 28) /* TC1 signal: TC1_TCLK4 */
#define PIN_PC31B_TC1_TCLK5                        _UINT32_(95) /* TC1 signal: TC1_TCLK5 on PC31 mux B */
#define MUX_PC31B_TC1_TCLK5                        _UINT32_(1)  /* TC1 signal line function value: TC1_TCLK5 */
#define PIO_PC31B_TC1_TCLK5                        (_UINT32_(1) << 31) /* TC1 signal: TC1_TCLK5 */
#define PIN_PC23B_TC1_TIOA3                        _UINT32_(87) /* TC1 signal: TC1_TIOA3 on PC23 mux B */
#define MUX_PC23B_TC1_TIOA3                        _UINT32_(1)  /* TC1 signal line function value: TC1_TIOA3 */
#define PIO_PC23B_TC1_TIOA3                        (_UINT32_(1) << 23) /* TC1 signal: TC1_TIOA3 */
#define PIN_PC26B_TC1_TIOA4                        _UINT32_(90) /* TC1 signal: TC1_TIOA4 on PC26 mux B */
#define MUX_PC26B_TC1_TIOA4                        _UINT32_(1)  /* TC1 signal line function value: TC1_TIOA4 */
#define PIO_PC26B_TC1_TIOA4                        (_UINT32_(1) << 26) /* TC1 signal: TC1_TIOA4 */
#define PIN_PC29B_TC1_TIOA5                        _UINT32_(93) /* TC1 signal: TC1_TIOA5 on PC29 mux B */
#define MUX_PC29B_TC1_TIOA5                        _UINT32_(1)  /* TC1 signal line function value: TC1_TIOA5 */
#define PIO_PC29B_TC1_TIOA5                        (_UINT32_(1) << 29) /* TC1 signal: TC1_TIOA5 */
#define PIN_PC24B_TC1_TIOB3                        _UINT32_(88) /* TC1 signal: TC1_TIOB3 on PC24 mux B */
#define MUX_PC24B_TC1_TIOB3                        _UINT32_(1)  /* TC1 signal line function value: TC1_TIOB3 */
#define PIO_PC24B_TC1_TIOB3                        (_UINT32_(1) << 24) /* TC1 signal: TC1_TIOB3 */
#define PIN_PC27B_TC1_TIOB4                        _UINT32_(91) /* TC1 signal: TC1_TIOB4 on PC27 mux B */
#define MUX_PC27B_TC1_TIOB4                        _UINT32_(1)  /* TC1 signal line function value: TC1_TIOB4 */
#define PIO_PC27B_TC1_TIOB4                        (_UINT32_(1) << 27) /* TC1 signal: TC1_TIOB4 */
#define PIN_PC30B_TC1_TIOB5                        _UINT32_(94) /* TC1 signal: TC1_TIOB5 on PC30 mux B */
#define MUX_PC30B_TC1_TIOB5                        _UINT32_(1)  /* TC1 signal line function value: TC1_TIOB5 */
#define PIO_PC30B_TC1_TIOB5                        (_UINT32_(1) << 30) /* TC1 signal: TC1_TIOB5 */
/* =================== PIO definition for TC2 peripheral ==================== */
#define PIN_PC7B_TC2_TCLK6                         _UINT32_(71) /* TC2 signal: TC2_TCLK6 on PC7 mux B */
#define MUX_PC7B_TC2_TCLK6                         _UINT32_(1)  /* TC2 signal line function value: TC2_TCLK6 */
#define PIO_PC7B_TC2_TCLK6                         (_UINT32_(1) << 7) /* TC2 signal: TC2_TCLK6 */
#define PIN_PC10B_TC2_TCLK7                        _UINT32_(74) /* TC2 signal: TC2_TCLK7 on PC10 mux B */
#define MUX_PC10B_TC2_TCLK7                        _UINT32_(1)  /* TC2 signal line function value: TC2_TCLK7 */
#define PIO_PC10B_TC2_TCLK7                        (_UINT32_(1) << 10) /* TC2 signal: TC2_TCLK7 */
#define PIN_PC14B_TC2_TCLK8                        _UINT32_(78) /* TC2 signal: TC2_TCLK8 on PC14 mux B */
#define MUX_PC14B_TC2_TCLK8                        _UINT32_(1)  /* TC2 signal line function value: TC2_TCLK8 */
#define PIO_PC14B_TC2_TCLK8                        (_UINT32_(1) << 14) /* TC2 signal: TC2_TCLK8 */
#define PIN_PC5B_TC2_TIOA6                         _UINT32_(69) /* TC2 signal: TC2_TIOA6 on PC5 mux B */
#define MUX_PC5B_TC2_TIOA6                         _UINT32_(1)  /* TC2 signal line function value: TC2_TIOA6 */
#define PIO_PC5B_TC2_TIOA6                         (_UINT32_(1) << 5) /* TC2 signal: TC2_TIOA6 */
#define PIN_PC8B_TC2_TIOA7                         _UINT32_(72) /* TC2 signal: TC2_TIOA7 on PC8 mux B */
#define MUX_PC8B_TC2_TIOA7                         _UINT32_(1)  /* TC2 signal line function value: TC2_TIOA7 */
#define PIO_PC8B_TC2_TIOA7                         (_UINT32_(1) << 8) /* TC2 signal: TC2_TIOA7 */
#define PIN_PC11B_TC2_TIOA8                        _UINT32_(75) /* TC2 signal: TC2_TIOA8 on PC11 mux B */
#define MUX_PC11B_TC2_TIOA8                        _UINT32_(1)  /* TC2 signal line function value: TC2_TIOA8 */
#define PIO_PC11B_TC2_TIOA8                        (_UINT32_(1) << 11) /* TC2 signal: TC2_TIOA8 */
#define PIN_PC6B_TC2_TIOB6                         _UINT32_(70) /* TC2 signal: TC2_TIOB6 on PC6 mux B */
#define MUX_PC6B_TC2_TIOB6                         _UINT32_(1)  /* TC2 signal line function value: TC2_TIOB6 */
#define PIO_PC6B_TC2_TIOB6                         (_UINT32_(1) << 6) /* TC2 signal: TC2_TIOB6 */
#define PIN_PC9B_TC2_TIOB7                         _UINT32_(73) /* TC2 signal: TC2_TIOB7 on PC9 mux B */
#define MUX_PC9B_TC2_TIOB7                         _UINT32_(1)  /* TC2 signal line function value: TC2_TIOB7 */
#define PIO_PC9B_TC2_TIOB7                         (_UINT32_(1) << 9) /* TC2 signal: TC2_TIOB7 */
#define PIN_PC12B_TC2_TIOB8                        _UINT32_(76) /* TC2 signal: TC2_TIOB8 on PC12 mux B */
#define MUX_PC12B_TC2_TIOB8                        _UINT32_(1)  /* TC2 signal line function value: TC2_TIOB8 */
#define PIO_PC12B_TC2_TIOB8                        (_UINT32_(1) << 12) /* TC2 signal: TC2_TIOB8 */
/* =================== PIO definition for TC3 peripheral ==================== */
#define PIN_PE2B_TC3_TCLK9                         _UINT32_(130) /* TC3 signal: TC3_TCLK9 on PE2 mux B */
#define MUX_PE2B_TC3_TCLK9                         _UINT32_(1)  /* TC3 signal line function value: TC3_TCLK9 */
#define PIO_PE2B_TC3_TCLK9                         (_UINT32_(1) << 2) /* TC3 signal: TC3_TCLK9 */
#define PIN_PE5B_TC3_TCLK10                        _UINT32_(133) /* TC3 signal: TC3_TCLK10 on PE5 mux B */
#define MUX_PE5B_TC3_TCLK10                        _UINT32_(1)  /* TC3 signal line function value: TC3_TCLK10 */
#define PIO_PE5B_TC3_TCLK10                        (_UINT32_(1) << 5) /* TC3 signal: TC3_TCLK10 */
#define PIN_PD24C_TC3_TCLK11                       _UINT32_(120) /* TC3 signal: TC3_TCLK11 on PD24 mux C */
#define MUX_PD24C_TC3_TCLK11                       _UINT32_(2)  /* TC3 signal line function value: TC3_TCLK11 */
#define PIO_PD24C_TC3_TCLK11                       (_UINT32_(1) << 24) /* TC3 signal: TC3_TCLK11 */
#define PIN_PE0B_TC3_TIOA9                         _UINT32_(128) /* TC3 signal: TC3_TIOA9 on PE0 mux B */
#define MUX_PE0B_TC3_TIOA9                         _UINT32_(1)  /* TC3 signal line function value: TC3_TIOA9 */
#define PIO_PE0B_TC3_TIOA9                         (_UINT32_(1) << 0) /* TC3 signal: TC3_TIOA9 */
#define PIN_PE3B_TC3_TIOA10                        _UINT32_(131) /* TC3 signal: TC3_TIOA10 on PE3 mux B */
#define MUX_PE3B_TC3_TIOA10                        _UINT32_(1)  /* TC3 signal line function value: TC3_TIOA10 */
#define PIO_PE3B_TC3_TIOA10                        (_UINT32_(1) << 3) /* TC3 signal: TC3_TIOA10 */
#define PIN_PD21C_TC3_TIOA11                       _UINT32_(117) /* TC3 signal: TC3_TIOA11 on PD21 mux C */
#define MUX_PD21C_TC3_TIOA11                       _UINT32_(2)  /* TC3 signal line function value: TC3_TIOA11 */
#define PIO_PD21C_TC3_TIOA11                       (_UINT32_(1) << 21) /* TC3 signal: TC3_TIOA11 */
#define PIN_PE1B_TC3_TIOB9                         _UINT32_(129) /* TC3 signal: TC3_TIOB9 on PE1 mux B */
#define MUX_PE1B_TC3_TIOB9                         _UINT32_(1)  /* TC3 signal line function value: TC3_TIOB9 */
#define PIO_PE1B_TC3_TIOB9                         (_UINT32_(1) << 1) /* TC3 signal: TC3_TIOB9 */
#define PIN_PE4B_TC3_TIOB10                        _UINT32_(132) /* TC3 signal: TC3_TIOB10 on PE4 mux B */
#define MUX_PE4B_TC3_TIOB10                        _UINT32_(1)  /* TC3 signal line function value: TC3_TIOB10 */
#define PIO_PE4B_TC3_TIOB10                        (_UINT32_(1) << 4) /* TC3 signal: TC3_TIOB10 */
#define PIN_PD22C_TC3_TIOB11                       _UINT32_(118) /* TC3 signal: TC3_TIOB11 on PD22 mux C */
#define MUX_PD22C_TC3_TIOB11                       _UINT32_(2)  /* TC3 signal line function value: TC3_TIOB11 */
#define PIO_PD22C_TC3_TIOB11                       (_UINT32_(1) << 22) /* TC3 signal: TC3_TIOB11 */
/* ================== PIO definition for TWIHS0 peripheral ================== */
#define PIN_PA4A_TWIHS0_TWCK0                      _UINT32_(4)  /* TWIHS0 signal: TWIHS0_TWCK0 on PA4 mux A */
#define MUX_PA4A_TWIHS0_TWCK0                      _UINT32_(0)  /* TWIHS0 signal line function value: TWIHS0_TWCK0 */
#define PIO_PA4A_TWIHS0_TWCK0                      (_UINT32_(1) << 4) /* TWIHS0 signal: TWIHS0_TWCK0 */
#define PIN_PA3A_TWIHS0_TWD0                       _UINT32_(3)  /* TWIHS0 signal: TWIHS0_TWD0 on PA3 mux A */
#define MUX_PA3A_TWIHS0_TWD0                       _UINT32_(0)  /* TWIHS0 signal line function value: TWIHS0_TWD0 */
#define PIO_PA3A_TWIHS0_TWD0                       (_UINT32_(1) << 3) /* TWIHS0 signal: TWIHS0_TWD0 */
/* ================== PIO definition for TWIHS1 peripheral ================== */
#define PIN_PB5A_TWIHS1_TWCK1                      _UINT32_(37) /* TWIHS1 signal: TWIHS1_TWCK1 on PB5 mux A */
#define MUX_PB5A_TWIHS1_TWCK1                      _UINT32_(0)  /* TWIHS1 signal line function value: TWIHS1_TWCK1 */
#define PIO_PB5A_TWIHS1_TWCK1                      (_UINT32_(1) << 5) /* TWIHS1 signal: TWIHS1_TWCK1 */
#define PIN_PB4A_TWIHS1_TWD1                       _UINT32_(36) /* TWIHS1 signal: TWIHS1_TWD1 on PB4 mux A */
#define MUX_PB4A_TWIHS1_TWD1                       _UINT32_(0)  /* TWIHS1 signal line function value: TWIHS1_TWD1 */
#define PIO_PB4A_TWIHS1_TWD1                       (_UINT32_(1) << 4) /* TWIHS1 signal: TWIHS1_TWD1 */
/* ================== PIO definition for TWIHS2 peripheral ================== */
#define PIN_PD28C_TWIHS2_TWCK2                     _UINT32_(124) /* TWIHS2 signal: TWIHS2_TWCK2 on PD28 mux C */
#define MUX_PD28C_TWIHS2_TWCK2                     _UINT32_(2)  /* TWIHS2 signal line function value: TWIHS2_TWCK2 */
#define PIO_PD28C_TWIHS2_TWCK2                     (_UINT32_(1) << 28) /* TWIHS2 signal: TWIHS2_TWCK2 */
#define PIN_PD27C_TWIHS2_TWD2                      _UINT32_(123) /* TWIHS2 signal: TWIHS2_TWD2 on PD27 mux C */
#define MUX_PD27C_TWIHS2_TWD2                      _UINT32_(2)  /* TWIHS2 signal line function value: TWIHS2_TWD2 */
#define PIO_PD27C_TWIHS2_TWD2                      (_UINT32_(1) << 27) /* TWIHS2 signal: TWIHS2_TWD2 */
/* ================== PIO definition for UART0 peripheral =================== */
#define PIN_PA9A_UART0_URXD0                       _UINT32_(9)  /* UART0 signal: UART0_URXD0 on PA9 mux A */
#define MUX_PA9A_UART0_URXD0                       _UINT32_(0)  /* UART0 signal line function value: UART0_URXD0 */
#define PIO_PA9A_UART0_URXD0                       (_UINT32_(1) << 9) /* UART0 signal: UART0_URXD0 */
#define PIN_PA10A_UART0_UTXD0                      _UINT32_(10) /* UART0 signal: UART0_UTXD0 on PA10 mux A */
#define MUX_PA10A_UART0_UTXD0                      _UINT32_(0)  /* UART0 signal line function value: UART0_UTXD0 */
#define PIO_PA10A_UART0_UTXD0                      (_UINT32_(1) << 10) /* UART0 signal: UART0_UTXD0 */
/* ================== PIO definition for UART1 peripheral =================== */
#define PIN_PA5C_UART1_URXD1                       _UINT32_(5)  /* UART1 signal: UART1_URXD1 on PA5 mux C */
#define MUX_PA5C_UART1_URXD1                       _UINT32_(2)  /* UART1 signal line function value: UART1_URXD1 */
#define PIO_PA5C_UART1_URXD1                       (_UINT32_(1) << 5) /* UART1 signal: UART1_URXD1 */
#define PIN_PA4C_UART1_UTXD1                       _UINT32_(4)  /* UART1 signal: UART1_UTXD1 on PA4 mux C */
#define MUX_PA4C_UART1_UTXD1                       _UINT32_(2)  /* UART1 signal line function value: UART1_UTXD1 */
#define PIO_PA4C_UART1_UTXD1                       (_UINT32_(1) << 4) /* UART1 signal: UART1_UTXD1 */
#define PIN_PA6C_UART1_UTXD1                       _UINT32_(6)  /* UART1 signal: UART1_UTXD1 on PA6 mux C */
#define MUX_PA6C_UART1_UTXD1                       _UINT32_(2)  /* UART1 signal line function value: UART1_UTXD1 */
#define PIO_PA6C_UART1_UTXD1                       (_UINT32_(1) << 6) /* UART1 signal: UART1_UTXD1 */
#define PIN_PD26D_UART1_UTXD1                      _UINT32_(122) /* UART1 signal: UART1_UTXD1 on PD26 mux D */
#define MUX_PD26D_UART1_UTXD1                      _UINT32_(3)  /* UART1 signal line function value: UART1_UTXD1 */
#define PIO_PD26D_UART1_UTXD1                      (_UINT32_(1) << 26) /* UART1 signal: UART1_UTXD1 */
/* ================== PIO definition for UART2 peripheral =================== */
#define PIN_PD25C_UART2_URXD2                      _UINT32_(121) /* UART2 signal: UART2_URXD2 on PD25 mux C */
#define MUX_PD25C_UART2_URXD2                      _UINT32_(2)  /* UART2 signal line function value: UART2_URXD2 */
#define PIO_PD25C_UART2_URXD2                      (_UINT32_(1) << 25) /* UART2 signal: UART2_URXD2 */
#define PIN_PD26C_UART2_UTXD2                      _UINT32_(122) /* UART2 signal: UART2_UTXD2 on PD26 mux C */
#define MUX_PD26C_UART2_UTXD2                      _UINT32_(2)  /* UART2 signal line function value: UART2_UTXD2 */
#define PIO_PD26C_UART2_UTXD2                      (_UINT32_(1) << 26) /* UART2 signal: UART2_UTXD2 */
/* ================== PIO definition for UART3 peripheral =================== */
#define PIN_PD28A_UART3_URXD3                      _UINT32_(124) /* UART3 signal: UART3_URXD3 on PD28 mux A */
#define MUX_PD28A_UART3_URXD3                      _UINT32_(0)  /* UART3 signal line function value: UART3_URXD3 */
#define PIO_PD28A_UART3_URXD3                      (_UINT32_(1) << 28) /* UART3 signal: UART3_URXD3 */
#define PIN_PD30A_UART3_UTXD3                      _UINT32_(126) /* UART3 signal: UART3_UTXD3 on PD30 mux A */
#define MUX_PD30A_UART3_UTXD3                      _UINT32_(0)  /* UART3 signal line function value: UART3_UTXD3 */
#define PIO_PD30A_UART3_UTXD3                      (_UINT32_(1) << 30) /* UART3 signal: UART3_UTXD3 */
#define PIN_PD31B_UART3_UTXD3                      _UINT32_(127) /* UART3 signal: UART3_UTXD3 on PD31 mux B */
#define MUX_PD31B_UART3_UTXD3                      _UINT32_(1)  /* UART3 signal line function value: UART3_UTXD3 */
#define PIO_PD31B_UART3_UTXD3                      (_UINT32_(1) << 31) /* UART3 signal: UART3_UTXD3 */
/* ================== PIO definition for UART4 peripheral =================== */
#define PIN_PD18C_UART4_URXD4                      _UINT32_(114) /* UART4 signal: UART4_URXD4 on PD18 mux C */
#define MUX_PD18C_UART4_URXD4                      _UINT32_(2)  /* UART4 signal line function value: UART4_URXD4 */
#define PIO_PD18C_UART4_URXD4                      (_UINT32_(1) << 18) /* UART4 signal: UART4_URXD4 */
#define PIN_PD3C_UART4_UTXD4                       _UINT32_(99) /* UART4 signal: UART4_UTXD4 on PD3 mux C */
#define MUX_PD3C_UART4_UTXD4                       _UINT32_(2)  /* UART4 signal line function value: UART4_UTXD4 */
#define PIO_PD3C_UART4_UTXD4                       (_UINT32_(1) << 3) /* UART4 signal: UART4_UTXD4 */
#define PIN_PD19C_UART4_UTXD4                      _UINT32_(115) /* UART4 signal: UART4_UTXD4 on PD19 mux C */
#define MUX_PD19C_UART4_UTXD4                      _UINT32_(2)  /* UART4 signal line function value: UART4_UTXD4 */
#define PIO_PD19C_UART4_UTXD4                      (_UINT32_(1) << 19) /* UART4 signal: UART4_UTXD4 */
/* ================== PIO definition for USART0 peripheral ================== */
#define PIN_PB2C_USART0_CTS0                       _UINT32_(34) /* USART0 signal: USART0_CTS0 on PB2 mux C */
#define MUX_PB2C_USART0_CTS0                       _UINT32_(2)  /* USART0 signal line function value: USART0_CTS0 */
#define PIO_PB2C_USART0_CTS0                       (_UINT32_(1) << 2) /* USART0 signal: USART0_CTS0 */
#define PIN_PD0D_USART0_DCD0                       _UINT32_(96) /* USART0 signal: USART0_DCD0 on PD0 mux D */
#define MUX_PD0D_USART0_DCD0                       _UINT32_(3)  /* USART0 signal line function value: USART0_DCD0 */
#define PIO_PD0D_USART0_DCD0                       (_UINT32_(1) << 0) /* USART0 signal: USART0_DCD0 */
#define PIN_PD2D_USART0_DSR0                       _UINT32_(98) /* USART0 signal: USART0_DSR0 on PD2 mux D */
#define MUX_PD2D_USART0_DSR0                       _UINT32_(3)  /* USART0 signal line function value: USART0_DSR0 */
#define PIO_PD2D_USART0_DSR0                       (_UINT32_(1) << 2) /* USART0 signal: USART0_DSR0 */
#define PIN_PD1D_USART0_DTR0                       _UINT32_(97) /* USART0 signal: USART0_DTR0 on PD1 mux D */
#define MUX_PD1D_USART0_DTR0                       _UINT32_(3)  /* USART0 signal line function value: USART0_DTR0 */
#define PIO_PD1D_USART0_DTR0                       (_UINT32_(1) << 1) /* USART0 signal: USART0_DTR0 */
#define PIN_PD3D_USART0_RI0                        _UINT32_(99) /* USART0 signal: USART0_RI0 on PD3 mux D */
#define MUX_PD3D_USART0_RI0                        _UINT32_(3)  /* USART0 signal line function value: USART0_RI0 */
#define PIO_PD3D_USART0_RI0                        (_UINT32_(1) << 3) /* USART0 signal: USART0_RI0 */
#define PIN_PB3C_USART0_RTS0                       _UINT32_(35) /* USART0 signal: USART0_RTS0 on PB3 mux C */
#define MUX_PB3C_USART0_RTS0                       _UINT32_(2)  /* USART0 signal line function value: USART0_RTS0 */
#define PIO_PB3C_USART0_RTS0                       (_UINT32_(1) << 3) /* USART0 signal: USART0_RTS0 */
#define PIN_PB0C_USART0_RXD0                       _UINT32_(32) /* USART0 signal: USART0_RXD0 on PB0 mux C */
#define MUX_PB0C_USART0_RXD0                       _UINT32_(2)  /* USART0 signal line function value: USART0_RXD0 */
#define PIO_PB0C_USART0_RXD0                       (_UINT32_(1) << 0) /* USART0 signal: USART0_RXD0 */
#define PIN_PB13C_USART0_SCK0                      _UINT32_(45) /* USART0 signal: USART0_SCK0 on PB13 mux C */
#define MUX_PB13C_USART0_SCK0                      _UINT32_(2)  /* USART0 signal line function value: USART0_SCK0 */
#define PIO_PB13C_USART0_SCK0                      (_UINT32_(1) << 13) /* USART0 signal: USART0_SCK0 */
#define PIN_PB1C_USART0_TXD0                       _UINT32_(33) /* USART0 signal: USART0_TXD0 on PB1 mux C */
#define MUX_PB1C_USART0_TXD0                       _UINT32_(2)  /* USART0 signal line function value: USART0_TXD0 */
#define PIO_PB1C_USART0_TXD0                       (_UINT32_(1) << 1) /* USART0 signal: USART0_TXD0 */
/* ================== PIO definition for USART1 peripheral ================== */
#define PIN_PA25A_USART1_CTS1                      _UINT32_(25) /* USART1 signal: USART1_CTS1 on PA25 mux A */
#define MUX_PA25A_USART1_CTS1                      _UINT32_(0)  /* USART1 signal line function value: USART1_CTS1 */
#define PIO_PA25A_USART1_CTS1                      (_UINT32_(1) << 25) /* USART1 signal: USART1_CTS1 */
#define PIN_PA26A_USART1_DCD1                      _UINT32_(26) /* USART1 signal: USART1_DCD1 on PA26 mux A */
#define MUX_PA26A_USART1_DCD1                      _UINT32_(0)  /* USART1 signal line function value: USART1_DCD1 */
#define PIO_PA26A_USART1_DCD1                      (_UINT32_(1) << 26) /* USART1 signal: USART1_DCD1 */
#define PIN_PA28A_USART1_DSR1                      _UINT32_(28) /* USART1 signal: USART1_DSR1 on PA28 mux A */
#define MUX_PA28A_USART1_DSR1                      _UINT32_(0)  /* USART1 signal line function value: USART1_DSR1 */
#define PIO_PA28A_USART1_DSR1                      (_UINT32_(1) << 28) /* USART1 signal: USART1_DSR1 */
#define PIN_PA27A_USART1_DTR1                      _UINT32_(27) /* USART1 signal: USART1_DTR1 on PA27 mux A */
#define MUX_PA27A_USART1_DTR1                      _UINT32_(0)  /* USART1 signal line function value: USART1_DTR1 */
#define PIO_PA27A_USART1_DTR1                      (_UINT32_(1) << 27) /* USART1 signal: USART1_DTR1 */
#define PIN_PA3B_USART1_LONCOL1                    _UINT32_(3)  /* USART1 signal: USART1_LONCOL1 on PA3 mux B */
#define MUX_PA3B_USART1_LONCOL1                    _UINT32_(1)  /* USART1 signal line function value: USART1_LONCOL1 */
#define PIO_PA3B_USART1_LONCOL1                    (_UINT32_(1) << 3) /* USART1 signal: USART1_LONCOL1 */
#define PIN_PA29A_USART1_RI1                       _UINT32_(29) /* USART1 signal: USART1_RI1 on PA29 mux A */
#define MUX_PA29A_USART1_RI1                       _UINT32_(0)  /* USART1 signal line function value: USART1_RI1 */
#define PIO_PA29A_USART1_RI1                       (_UINT32_(1) << 29) /* USART1 signal: USART1_RI1 */
#define PIN_PA24A_USART1_RTS1                      _UINT32_(24) /* USART1 signal: USART1_RTS1 on PA24 mux A */
#define MUX_PA24A_USART1_RTS1                      _UINT32_(0)  /* USART1 signal line function value: USART1_RTS1 */
#define PIO_PA24A_USART1_RTS1                      (_UINT32_(1) << 24) /* USART1 signal: USART1_RTS1 */
#define PIN_PA21A_USART1_RXD1                      _UINT32_(21) /* USART1 signal: USART1_RXD1 on PA21 mux A */
#define MUX_PA21A_USART1_RXD1                      _UINT32_(0)  /* USART1 signal line function value: USART1_RXD1 */
#define PIO_PA21A_USART1_RXD1                      (_UINT32_(1) << 21) /* USART1 signal: USART1_RXD1 */
#define PIN_PA23A_USART1_SCK1                      _UINT32_(23) /* USART1 signal: USART1_SCK1 on PA23 mux A */
#define MUX_PA23A_USART1_SCK1                      _UINT32_(0)  /* USART1 signal line function value: USART1_SCK1 */
#define PIO_PA23A_USART1_SCK1                      (_UINT32_(1) << 23) /* USART1 signal: USART1_SCK1 */
#define PIN_PB4D_USART1_TXD1                       _UINT32_(36) /* USART1 signal: USART1_TXD1 on PB4 mux D */
#define MUX_PB4D_USART1_TXD1                       _UINT32_(3)  /* USART1 signal line function value: USART1_TXD1 */
#define PIO_PB4D_USART1_TXD1                       (_UINT32_(1) << 4) /* USART1 signal: USART1_TXD1 */
/* ================== PIO definition for USART2 peripheral ================== */
#define PIN_PD19B_USART2_CTS2                      _UINT32_(115) /* USART2 signal: USART2_CTS2 on PD19 mux B */
#define MUX_PD19B_USART2_CTS2                      _UINT32_(1)  /* USART2 signal line function value: USART2_CTS2 */
#define PIO_PD19B_USART2_CTS2                      (_UINT32_(1) << 19) /* USART2 signal: USART2_CTS2 */
#define PIN_PD4D_USART2_DCD2                       _UINT32_(100) /* USART2 signal: USART2_DCD2 on PD4 mux D */
#define MUX_PD4D_USART2_DCD2                       _UINT32_(3)  /* USART2 signal line function value: USART2_DCD2 */
#define PIO_PD4D_USART2_DCD2                       (_UINT32_(1) << 4) /* USART2 signal: USART2_DCD2 */
#define PIN_PD6D_USART2_DSR2                       _UINT32_(102) /* USART2 signal: USART2_DSR2 on PD6 mux D */
