WebDust21/framework-cmsis-atmelsam/samv71_rt/include/pio/samv71q21rt.h
#define MUX_PD6D_USART2_DSR2                       _UINT32_(3)  /* USART2 signal line function value: USART2_DSR2 */
#define PIO_PD6D_USART2_DSR2                       (_UINT32_(1) << 6) /* USART2 signal: USART2_DSR2 */
#define PIN_PD5D_USART2_DTR2                       _UINT32_(101) /* USART2 signal: USART2_DTR2 on PD5 mux D */
#define MUX_PD5D_USART2_DTR2                       _UINT32_(3)  /* USART2 signal line function value: USART2_DTR2 */
#define PIO_PD5D_USART2_DTR2                       (_UINT32_(1) << 5) /* USART2 signal: USART2_DTR2 */
#define PIN_PD7D_USART2_RI2                        _UINT32_(103) /* USART2 signal: USART2_RI2 on PD7 mux D */
#define MUX_PD7D_USART2_RI2                        _UINT32_(3)  /* USART2 signal line function value: USART2_RI2 */
#define PIO_PD7D_USART2_RI2                        (_UINT32_(1) << 7) /* USART2 signal: USART2_RI2 */
#define PIN_PD18B_USART2_RTS2                      _UINT32_(114) /* USART2 signal: USART2_RTS2 on PD18 mux B */
#define MUX_PD18B_USART2_RTS2                      _UINT32_(1)  /* USART2 signal line function value: USART2_RTS2 */
#define PIO_PD18B_USART2_RTS2                      (_UINT32_(1) << 18) /* USART2 signal: USART2_RTS2 */
#define PIN_PD15B_USART2_RXD2                      _UINT32_(111) /* USART2 signal: USART2_RXD2 on PD15 mux B */
#define MUX_PD15B_USART2_RXD2                      _UINT32_(1)  /* USART2 signal line function value: USART2_RXD2 */
#define PIO_PD15B_USART2_RXD2                      (_UINT32_(1) << 15) /* USART2 signal: USART2_RXD2 */
#define PIN_PD17B_USART2_SCK2                      _UINT32_(113) /* USART2 signal: USART2_SCK2 on PD17 mux B */
#define MUX_PD17B_USART2_SCK2                      _UINT32_(1)  /* USART2 signal line function value: USART2_SCK2 */
#define PIO_PD17B_USART2_SCK2                      (_UINT32_(1) << 17) /* USART2 signal: USART2_SCK2 */
#define PIN_PD16B_USART2_TXD2                      _UINT32_(112) /* USART2 signal: USART2_TXD2 on PD16 mux B */
#define MUX_PD16B_USART2_TXD2                      _UINT32_(1)  /* USART2 signal line function value: USART2_TXD2 */
#define PIO_PD16B_USART2_TXD2                      (_UINT32_(1) << 16) /* USART2 signal: USART2_TXD2 */
/* =================== PIO definition for ICE peripheral ==================== */
#define PIN_PB7X1_ICE_SWDCLK                       _UINT32_(39) /* ICE signal: ICE_SWDCLK on PB7 mux X1 */
#define PIO_PB7X1_ICE_SWDCLK                       (_UINT32_(1) << 7) /* ICE signal: ICE_SWDCLK */
#define PIN_PB6X1_ICE_SWDIO                        _UINT32_(38) /* ICE signal: ICE_SWDIO on PB6 mux X1 */
#define PIO_PB6X1_ICE_SWDIO                        (_UINT32_(1) << 6) /* ICE signal: ICE_SWDIO */
#define PIN_PB7X1_ICE_TCK                          _UINT32_(39) /* ICE signal: ICE_TCK on PB7 mux X1 */
#define PIO_PB7X1_ICE_TCK                          (_UINT32_(1) << 7) /* ICE signal: ICE_TCK */
#define PIN_PB4X1_ICE_TDI                          _UINT32_(36) /* ICE signal: ICE_TDI on PB4 mux X1 */
#define PIO_PB4X1_ICE_TDI                          (_UINT32_(1) << 4) /* ICE signal: ICE_TDI */
#define PIN_PB5X1_ICE_TDO                          _UINT32_(37) /* ICE signal: ICE_TDO on PB5 mux X1 */
#define PIO_PB5X1_ICE_TDO                          (_UINT32_(1) << 5) /* ICE signal: ICE_TDO */
#define PIN_PB6X1_ICE_TMS                          _UINT32_(38) /* ICE signal: ICE_TMS on PB6 mux X1 */
#define PIO_PB6X1_ICE_TMS                          (_UINT32_(1) << 6) /* ICE signal: ICE_TMS */
#define PIN_PB5X1_ICE_TRACESWO                     _UINT32_(37) /* ICE signal: ICE_TRACESWO on PB5 mux X1 */
#define PIO_PB5X1_ICE_TRACESWO                     (_UINT32_(1) << 5) /* ICE signal: ICE_TRACESWO */
/* =================== PIO definition for TPIU peripheral =================== */
#define PIN_PD8D_TPIU_TRACECLK                     _UINT32_(104) /* TPIU signal: TPIU_TRACECLK on PD8 mux D */
#define MUX_PD8D_TPIU_TRACECLK                     _UINT32_(3)  /* TPIU signal line function value: TPIU_TRACECLK */
#define PIO_PD8D_TPIU_TRACECLK                     (_UINT32_(1) << 8) /* TPIU signal: TPIU_TRACECLK */
#define PIN_PD4C_TPIU_TRACED0                      _UINT32_(100) /* TPIU signal: TPIU_TRACED0 on PD4 mux C */
#define MUX_PD4C_TPIU_TRACED0                      _UINT32_(2)  /* TPIU signal line function value: TPIU_TRACED0 */
#define PIO_PD4C_TPIU_TRACED0                      (_UINT32_(1) << 4) /* TPIU signal: TPIU_TRACED0 */
#define PIN_PD5C_TPIU_TRACED1                      _UINT32_(101) /* TPIU signal: TPIU_TRACED1 on PD5 mux C */
#define MUX_PD5C_TPIU_TRACED1                      _UINT32_(2)  /* TPIU signal line function value: TPIU_TRACED1 */
#define PIO_PD5C_TPIU_TRACED1                      (_UINT32_(1) << 5) /* TPIU signal: TPIU_TRACED1 */
#define PIN_PD6C_TPIU_TRACED2                      _UINT32_(102) /* TPIU signal: TPIU_TRACED2 on PD6 mux C */
#define MUX_PD6C_TPIU_TRACED2                      _UINT32_(2)  /* TPIU signal line function value: TPIU_TRACED2 */
#define PIO_PD6C_TPIU_TRACED2                      (_UINT32_(1) << 6) /* TPIU signal: TPIU_TRACED2 */
#define PIN_PD7C_TPIU_TRACED3                      _UINT32_(103) /* TPIU signal: TPIU_TRACED3 on PD7 mux C */
#define MUX_PD7C_TPIU_TRACED3                      _UINT32_(2)  /* TPIU signal line function value: TPIU_TRACED3 */
#define PIO_PD7C_TPIU_TRACED3                      (_UINT32_(1) << 7) /* TPIU signal: TPIU_TRACED3 */

#endif /* _SAMV71Q21RT_GPIO_H_ */

